<template>
  <!-- <div class="PrivacyNotice" data-theme="wireframe"> -->
    <div class="hero min-auto" ref="home" id="home">
      <!-- <div class="hero-overlay bg-dark bg-opacity-0 z-10 min-h-screen"></div> -->
      <div class="hero-content flex-col lg:flex-row-reverse w-full">
        <div class="container">
          <div class="text-center lg:text-center">
            <div class="text-4xl lg:text-5xl font-bold mt-6" ref="text">
              Privacy Notice
            </div>
            <div class="divider text-orange-500">
              ประกาศเกี่ยวกับความเป็นส่วนตัว (Me Verse)
            </div>
            <div class="container">
              <span class="text-orange-500 my-5">
                เรื่อง นโยบายการคุ้มครองข้อมูลส่วนบุคคล
              </span>

              <div>
                <section class="container text-left text-sm">
                  <div class="card bg-base-100 shadow-xl">
                    <div class="card-body">
                      <!-- <h2 class="card-title text-sm">1. วัตถุประสงค์</h2> -->
                      <p>
                        ประกาศเกี่ยวกับความเป็นส่วนตัวฉบับนี้จึงจัดทำขึ้นเพื่อให้ท่านในฐานะ
                        ผู้สมัครสมาชิกของเว็บไซต์ สสส.
                        (ซึ่งต่อไปในประกาศนี้เรียกว่า "เจ้าของข้อมูลส่วนบุคคล")
                        ได้ทราบและเข้าใจรูปแบบ วิธีการ
                        และวัตถุประสงค์และความจำเป็นของกองทุนสนับสนุนการสร้างเสริมสุขภาพ
                        ("สสส.") ในฐานะผู้ควบคุมข้อมูลส่วนบุคคล
                        ที่ต้องดำเนินการเก็บรวบรวม ใช้
                        หรือเปิดเผยข้อมูลส่วนบุคคลจากท่าน
                        รวมทั้งทราบถึงนโยบายการคุ้มครองข้อมูลส่วนบุคคล
                        มาตรการในการรักษาความมั่นคงปลอดภัยของข้อมูลส่วนบุคคล
                        ตลอดจนสิทธิตามกฎหมายของท่านในฐานะเจ้าของข้อมูลส่วนบุคคล
                        ซึ่งมีรายละเอียดดังต่อไปนี้
                      </p>

                      <div class="divider"></div>
                      <b>1. ฐานกฎหมายในการเก็บรวบรวมข้อมูลส่วนบุคคล</b>
                      <p>
                        สสส.
                        จำเป็นต้องดำเนินการเก็บรวบรวมข้อมูลส่วนบุคคลของท่านภายใต้ฐานกฎหมาย
                        โดยมีรายละเอียด ดังต่อไปนี้
                      </p>
                      <ul class="menu bg-base-100">
                        <li class="disabled">
                          <!-- <a href="#"> -->
                          <p class="text-left" style="color: grey">
                            (1)
                            ดำเนินการเก็บรวบรวมข้อมูลส่วนบุคคลเพื่อการปฏิบัติตามสัญญา
                            (Contract)
                            โดยนำข้อมูลส่วนบุคคลของท่านไปใช้ประโยชน์ในประชาสัมพันธ์กิจกรรมและข้อมูลข่าวสารของ
                            สสส. ให้กับท่านทราบ
                            ตลอดจนเชิญท่านเข้าร่วมกิจกรรมต่าง ๆ ของ สสส. หาก
                            สสส. ไม่ได้รับข้อมูลส่วนบุคคลดังกล่าวจะทำให้ สสส.
                            ไม่สามารถดำเนินงานให้เป็นไปตามวัตถุประสงค์ได้
                          </p>
                          <!-- </a> -->
                        </li>
                        <li class="disabled">
                          <!-- <a href="#"> -->
                          <p class="text-left" style="color: grey">
                            (2)
                            ดำเนินการเก็บรวบรวมข้อมูลส่วนบุคคลเพื่อประโยชน์ชอบด้วยกฎหมาย
                            (Legitimate Interest)
                            โดยนำข้อมูลส่วนบุคคลของท่านไปใช้ประโยชน์ในการวิเคราะห์สังเคราะห์
                            เพื่อนำมาปรับปรุง วางแผนการดำเนินกิจกรรมต่าง ๆ
                            และการประชาสัมพันธ์ และการใช้งานภายใน สสส.
                          </p>
                          <!-- </a> -->
                        </li>
                      </ul>
                      <div class="divider"></div>
                      <b>2. วัตถุประสงค์ในการเก็บรวบรวมข้อมูลส่วนบุคคล</b>
                      <p>
                        สสส.
                        ดำเนินการเก็บรวบรวมข้อมูลส่วนบุคคลของท่านเพื่อใช้ประโยชน์ในประชาสัมพันธ์กิจกรรมและข้อมูลข่าวสารของ
                        สสส. ให้กับท่านทราบ ตลอดจนเชิญท่านเข้าร่วมกิจกรรมต่าง ๆ
                        ของ สสส.
                      </p>
                      <div class="divider"></div>
                      <b>3. แหล่งข้อมูลและรายการข้อมูลส่วนบุคคลที่เก็บรวบรวม</b>
                      <p>
                        สสส.
                        ดำเนินการเก็บรวบรวมข้อมูลส่วนบุคคลของท่านจากแหล่งข้อมูลและรายการข้อมูล
                        ดังต่อไปนี้
                      </p>
                      <div class="overflow-x-auto">
                        <table class="table table-compact w-full">
                          <thead>
                            <tr>
                              <th>แหล่งข้อมูล/วิธีการเก็บรวบรวม</th>
                              <th>รายการข้อมูลส่วนบุคคล</th>
                            </tr>
                          </thead>
                          <tbody>
                            <tr>
                              <th>
                                เก็บข้อมูลจากท่านโดยตรงผ่านหน้าเว็บไซต์ สสส.
                                ในส่วนของการสมัครสมาชิกเว็บไซต์
                              </th>
                              <td>
                                ชื่อ นามสกุล อีเมล ชื่อเล่น รวมถึงข้อมูลอื่น ๆ
                                ที่ท่านได้กรอกผ่านหน้าเว็บไซต์ สสส.
                                ในส่วนของการสมัครสมาชิกเว็บไซต์
                                ซึ่งสามารถเชื่อมโยงไปถึงเจ้าของข้อมูลส่วนบุคคล
                              </td>
                            </tr>
                          </tbody>
                        </table>
                      </div>
                      <div class="divider"></div>
                      <b>4. ระยะเวลาในการเก็บรวบรวมข้อมูลส่วนบุคคล</b>
                      <!-- <p>สสส. จำเป็นต้องดำเนินการเก็บรวบรวมข้อมูลส่วนบุคคลของท่านภายใต้ฐานกฎหมาย โดยมีรายละเอียด ดังต่อไปนี้</p> -->
                      <ul class="menu bg-base-100">
                        <li class="disabled">
                          <!-- <a href="#"> -->
                          <p class="text-left" style="color: grey">
                            4.1 สสส. ดำเนินการเก็บรวบรวมข้อมูลส่วนบุคคลของท่าน
                            เป็นระยะเวลาไม่เกิน 5 ปี
                            นับแต่นับแต่วันที่ที่ท่านได้สมัครเป็นสมาชิกเว็บไซต์
                            สสส. ยกเว้นจะมีกฎหมายไว้เป็นอย่างอื่น
                          </p>
                          <!-- </a> -->
                        </li>
                        <li class="disabled">
                          <!-- <a href="#"> -->
                          <p class="text-left" style="color: grey">
                            4.2 เมื่อครบกำหนดระยะเวลาตามข้อ 4.1
                            หรือเมื่อข้อมูลส่วนบุคคลของท่านไม่สามารถใช้ประโยชน์ได้ตามวัตถุประสงค์ที่กำหนดไว้ในข้อ
                            2. สสส.
                            จะลบหรือทำลายหรือทำให้ข้อมูลส่วนบุคคลของท่านเป็นข้อมูลที่ไม่สามารถระบุตัวตนของเจ้าของข้อมูลส่วนบุคคลได้อีก
                          </p>
                          <!-- </a> -->
                        </li>
                      </ul>
                      <div class="divider"></div>
                      <b>5. มาตรการรักษาความมั่นคงปลอดภัยข้อมูลส่วนบุคคล</b>
                      <!-- <p>สสส. จำเป็นต้องดำเนินการเก็บรวบรวมข้อมูลส่วนบุคคลของท่านภายใต้ฐานกฎหมาย โดยมีรายละเอียด ดังต่อไปนี้</p> -->
                      <ul class="menu bg-base-100">
                        <li class="disabled">
                          <!-- <a href="#"> -->
                          <p class="text-left" style="color: grey">
                            5.1 สสส.
                            มีมาตรการในการรักษาความมั่นคงปลอดภัยข้อมูลส่วนบุคคลของท่านอย่างเหมาะสม
                            ทั้งในเชิงเทคนิคและการบริหารจัดการ
                            เพื่อป้องกันมิให้ข้อมูลสูญหาย หรือมีการเข้าถึง ทำลาย
                            ใช้ เปลี่ยนแปลง แก้ไข
                            หรือเปิดเผยข้อมูลส่วนบุคคลโดยไม่ได้รับอนุญาต
                            ซึ่งสอดคล้องกับนโยบายและแนวปฏิบัติด้านความมั่นคงปลอดภัยสารสนเทศ
                            (Information Security Policy) ของ สสส.
                          </p>
                          <!-- </a> -->
                        </li>
                        <li class="disabled">
                          <!-- <a href="#"> -->
                          <p class="text-left" style="color: grey">
                            5.2 สสส.
                            ได้กำหนดนโยบายการคุ้มครองข้อมูลส่วนบุคคลที่ประกาศให้ทราบโดยทั่วกันทั้งองค์กร
                            พร้อมทั้งกำหนดแนวทางปฏิบัติเพื่อให้เกิดความมั่นคงปลอดภัยในการเก็บรวบรวม
                            ใช้ และเปิดเผยข้อมูลส่วนบุคคล
                            โดยธำรงไว้ซึ่งความเป็นความลับ (Confidentiality)
                            ความถูกต้องครบถ้วน (Integrity) และสภาพพร้อมใช้งาน
                            (Availability) ของข้อมูลส่วนบุคคล
                          </p>
                          <!-- </a> -->
                        </li>
                      </ul>

                      <div class="divider"></div>
                      <b>6. สิทธิของเจ้าของข้อมูลส่วนบุคคล</b>
                      <p>
                        เพื่อให้ข้อมูลส่วนบุคคลของท่านยังคงอยู่ในความควบคุมของท่านได้มากขึ้น
                        ท่านสามารถใช้สิทธิเกี่ยวกับข้อมูลส่วนบุคคลของท่านได้ตามพระราชบัญญัติคุ้มครองข้อมูลส่วนบุคคล
                        พ.ศ. 2562 ดังต่อไปนี้
                      </p>
                      <ul class="menu bg-base-100">
                        <li class="disabled">
                          <!-- <a href="#"> -->
                          <p class="text-left" style="color: grey">
                            (1) สิทธิในการเข้าถึง ขอสำเนา
                            หรือขอรับข้อมูลส่วนบุคคลที่เก็บรวบรวมไว้
                            รวมถึงขอให้เปิดเผยถึง
                            การได้มาซึ่งข้อมูลส่วนบุคคลที่เจ้าของข้อมูลส่วนบุคคลไม่ได้ให้ความยินยอม
                            เว้นแต่กรณีที่ สสส.
                            มีสิทธิปฏิเสธคำขอของท่านได้ตามกฎหมาย
                          </p>
                          <!-- </a> -->
                        </li>
                        <li class="disabled">
                          <!-- <a href="#"> -->
                          <p class="text-left" style="color: grey">
                            (2)
                            สิทธิขอรับหรือขอให้ส่งหรือโอนข้อมูลส่วนบุคคลที่มีการจัดทำให้อยู่ในรูปแบบที่สามารถอ่านหรือใช้งานได้ด้วยเครื่องมือหรืออุปกรณ์ที่ทำงานได้โดยอัตโนมัติและสามารถใช้หรือเปิดเผยข้อมูลส่วนบุคคลได้ด้วยวิธีอัตโนมัติ
                            เว้นแต่กรณีที่ สสส.
                            มีสิทธิปฏิเสธคำขอของท่านได้ตามกฎหมาย
                          </p>
                          <!-- </a> -->
                        </li>
                        <li class="disabled">
                          <!-- <a href="#"> -->
                          <p class="text-left" style="color: grey">
                            (3) สิทธิในการคัดค้านหรือขอให้ระงับการเก็บรวบรวม ใช้
                            หรือเปิดเผยข้อมูลส่วนบุคคลตามเงื่อนไขที่กฎหมายกำหนด
                          </p>
                          <!-- </a> -->
                        </li>
                        <li class="disabled">
                          <!-- <a href="#"> -->
                          <p class="text-left" style="color: grey">
                            (4) สิทธิในการขอให้ลบ ทำลาย
                            หรือทำให้ข้อมูลส่วนบุคคลเป็นข้อมูลที่ไม่สามารถระบุตัวบุคคลของเจ้าของข้อมูลส่วนบุคคลได้ตามเงื่อนไขที่กฎหมายกำหนด
                            เว้นแต่กรณีที่ สสส.
                            มีสิทธิปฏิเสธคำขอของท่านได้ตามกฎหมาย
                          </p>
                          <!-- </a> -->
                        </li>
                        <li class="disabled">
                          <!-- <a href="#"> -->
                          <p class="text-left" style="color: grey">
                            (5)
                            สิทธิในการขอให้ดำเนินการให้ข้อมูลส่วนบุคคลถูกต้อง
                            เป็นปัจจุบัน สมบูรณ์ และไม่ก่อให้เกิดความเข้าใจผิด
                          </p>
                          <!-- </a> -->
                        </li>
                        <li class="disabled">
                          <!-- <a href="#"> -->
                          <p class="text-left" style="color: grey">
                            (6) สิทธิในการเพิกถอนความยินยอมในการเก็บรวบรวม ใช้
                            หรือเปิดเผยข้อมูลส่วนบุคคล
                            เว้นแต่ในกรณีที่มีกฎหมายหรือข้อตกลงกำหนดไว้เป็นอย่างอื่น
                          </p>
                          <!-- </a> -->
                        </li>
                      </ul>
                      <p>
                        ทั้งนี้ ท่านสามารถยื่นคำร้องขอให้ สสส.
                        ดำเนินการตามสิทธิได้โดยวิธีการหรือช่องทางดังนี้
                        แบบคำร้องขอใช้สิทธิของเจ้าของข้อมูลส่วนบุคคล ที่ สสส.
                        ได้จัดเตรียมไว้ให้ หรือ
                        <a href="https://pdpa.thaihealth.or.th"
                          >https://pdpa.thaihealth.or.th</a
                        >
                      </p>
                      <div class="divider"></div>
                      <b>7. การติดต่อ สสส.</b>
                      <p>
                        ท่านสามารถติดต่อสอบถามรายละเอียดในประกาศเกี่ยวกับความเป็นส่วนตัวนี้ได้ตามช่องทาง
                        ดังต่อไปนี้
                      </p>
                      <ul class="menu bg-base-100">
                        <li class="disabled">
                          <!-- <a href="#"> -->
                          <p class="text-left" style="color: grey">
                            7.1 ผู้ควบคุมข้อมูลส่วนบุคคล
                            <br />
                            กองทุนสนับสนุนการสร้างเสริมสุขภาพ (สสส.)
                            <br />
                            เลขที่ 99/8 ซอยงามดูพลี แขวงทุ่งมหาเมฆ เขตสาทร
                            กรุงเทพมหานคร 10120
                            <br />
                            โทร. 0 2343 1500 / อีเมล : dpo@thaihealth.or.th
                          </p>
                          <!-- </a> -->
                        </li>
                        <li class="disabled">
                          <!-- <a href="#"> -->
                          <p class="text-left" style="color: grey">
                            7.2 เจ้าหน้าที่คุ้มครองข้อมูลส่วนบุคคล
                            <br />
                            นายวิเชียร ทิพย์ชุมภู
                            <br />
                            เลขที่ 99/8 ซอยงามดูพลี แขวงทุ่งมหาเมฆ เขตสาทร
                            กรุงเทพมหานคร 10120
                            <br />
                            โทร. 0 2343 1500 / อีเมล : dpo@thaihealth.or.th
                          </p>
                          <!-- </a> -->
                        </li>
                      </ul>
                    </div>
                  </div>
                </section>
              </div>
            </div>
          </div>
        </div>
      </div>
    </div>
  <!-- </div> -->
</template>

<script>
export default {
  name: "PrivacyNotice",
  data() {
    return {};
  },
  computed: {},
  methods: {},
  mounted() {},
  beforeDestroy() {},
  watch: {},
};
</script>