<template>
  <div class="CookiePolicy" data-theme="wireframe">
    <div class="hero min-auto" ref="home" id="home">
      <div class="hero-overlay bg-dark bg-opacity-0 z-10 min-h-screen"></div>
      <div class="hero-content flex-col lg:flex-row-reverse w-full">

        <div class="container">
          <div class="text-center lg:text-center">
            <div class="text-4xl lg:text-5xl font-bold mt-6" ref="text">
              Cookies Policy
            </div>
            <div class="divider text-orange-500">ประกาศ Me Verse</div>
            <div class="container">
              <span class="text-orange-500 my-5">
                เรื่อง นโยบายด้านคุกกี้ (Cookies)
              </span>
              <div>
                <section class="container text-left text-sm">
                  <div class="card bg-base-100 shadow-xl">
                    <div class="card-body">
                      <h2 class="card-title text-sm">นโยบายคุกกี้</h2>
                      <p>
                         
                          เมื่อท่านได้เข้าสู่เว็บไซต์
                          ข้อมูลที่เกี่ยวข้องกับการเข้าสู่เว็บไซต์ของท่านจะถูกบันทึกไว้ในรูปแบบของคุกกี้
                          โดยนโยบายคุกกี้นี้จะอธิบายถึงความหมาย การทำงาน
                          วัตถุประสงค์ รวมถึงการลบและการปฏิเสธการเก็บคุกกี้
                          เพื่อความเป็นส่วนตัวของท่าน
                          โดยการเข้าสู่เว็บไซต์นี้ถือว่าท่านได้อนุญาตให้ สสส.
                          ใช้คุกกี้ตามนโยบายคุกกี้ที่มีรายละเอียดดังต่อไปนี้
                      </p>
                    </div>
                  </div>



                  
                            
                            
                            
                              
  
                            
                              
                            
                            
                           
                            
                            
                            
                            


                  <div class="card bg-base-100 shadow-xl mt-4">
                    <div class="card-body">
                      <h2 class="card-title text-sm">
                        คุกกี้คืออะไร
                      </h2>
                      <p>
                        คุกกี้ คือ ไฟล์เล็ก ๆ
                            เพื่อจัดเก็บข้อมูลการเข้าใช้งานเว็บไซต์ เช่น วันเวลา
                            ลิงค์ที่คลิก หน้าที่เข้าชม เงื่อนไขการตั้งค่าต่าง ๆ
                            โดยจะบันทึกลงไปในอุปกรณ์คอมพิวเตอร์ และ/หรือ
                            เครื่องมือสื่อสารที่เข้าใช้งานของท่าน เช่น โน๊ตบุ๊ค
                            แท็บเล็ต หรือ สมาร์ทโฟน
                            ผ่านทางเว็บเบราว์เซอร์ในขณะที่ท่านเข้าสู่เว็บไซต์
                            โดยคุกกี้จะไม่ก่อให้เกิดอันตรายต่ออุปกรณ์คอมพิวเตอร์
                            และ/หรือ เครื่องมือสื่อสารของท่าน ในกรณีดังต่อไปนี้
                            ข้อมูลส่วนบุคคลของท่านอาจถูกจัดเก็บเพื่อใช้เพิ่มประสบการณ์การใช้งานบริการทางออนไลน์
                            โดยจะจำเอกลักษณ์ของภาษาและปรับแต่งข้อมูลการใช้งานตามความต้องการของท่าน
                            เป็นการยืนยันคุณลักษณะเฉพาะตัว
                            ข้อมูลความปลอดภัยของท่าน รวมถึงบริการที่ท่านสนใจ
                            นอกจากนี้คุกกี้ยังถูกใช้เพื่อวัดปริมาณการเข้าใช้งานบริการทางออนไลน์
                            การปรับเปลี่ยนเนื้อหาตามการใช้งานของท่าน
                            โดยพิจารณาจากพฤติกรรมการเข้าใช้งานครั้งก่อน ๆ และ ณ
                            ปัจจุบัน
                            และอาจมีวัตถุประสงค์เพื่อการโฆษณาประชาสัมพันธ์
                        
                      </p>
                    </div>
                  </div>

                  <div class="card bg-base-100 shadow-xl mt-4">
                    <div class="card-body">
                      <h2 class="card-title text-sm">
                        เราใช้คุกกี้อย่างไร
                      </h2>
                      <p>
                        Me Verse (สสส.) ใช้คุกกี้
                            เพื่อบันทึกการเข้าเยี่ยมชมและสมัครเข้าใช้งานเว็บไซต์ของท่าน
                            โดยทำให้ Me Verse (สสส.)
                            สามารถจดจำการใช้งานเว็บไซต์ของท่านได้ง่ายขึ้น
                            และข้อมูลเหล่านี้จะถูกนำไปเพื่อปรับปรุงเว็บไซต์ของ
                            Me Verse (สสส.) ให้ตรงกับความต้องการของท่านมากยิ่งขึ้น
                            เพื่ออำนวยความสะดวกให้เกิดความรวดเร็วในการใช้งานเว็บไซต์ของท่าน
                            และในบางกรณี Me Verse (สสส.)
                            จำเป็นต้องให้บุคคลที่สามช่วยดำเนินการดังกล่าว
                            ซึ่งอาจจะต้องใช้อินเตอร์เน็ตโปรโตคอลแอดเดรส (IP Address) และคุกกี้เพื่อวิเคราะห์ทางสถิติ
                              ตลอดจนเชื่อมโยงข้อมูล
                              และประมวลผลตามวัตถุประสงค์ทางการตลาด
                              <br/>

<span>แบ่งเป็น 2 ประเภท</span>
<ul class="menu bg-base-100"><li><a href="#">
  1.Session Cookies
เป็นคุกกี้ที่จะอยู่ชั่วคราวเพื่อจดจำท่านในระหว่างที่ท่านเข้าเยี่ยมชมเว็บไซต์ของ
Me Verse (สสส.) เช่น เฝ้าติดตามภาษาที่ท่านได้ตั้งค่าและเลือกใช้
เป็นต้น
และจะมีการลบออกจากเครื่องคอมพิวเตอร์หรืออุปกรณ์ของท่าน
เมื่อท่านออกจากเว็บไซต์หรือได้ทำการปิดเว็บเบราว์เซอร์
</a>

</li>
<li><a href="#">
 

2.Persistent Cookie

เป็นคุกกี้ที่จะอยู่ตามระยะเวลาที่กำหนดหรือจนกว่าท่านจะลบออก
คุกกี้ประเภทนี้จะช่วยให้เว็บไซต์ของ Me Verse (สสส.)
จดจำท่านและการตั้งค่าต่าง ๆ
ของท่านเมื่อท่านกลับมาใช้บริการเว็บไซต์อีกครั้ง
ซึ่งจะช่วยให้ท่านเข้าใช้บริการเว็บไซต์ได้สะดวกรวดเร็วยิ่งขึ้น
</a></li>
</ul>
                      </p>
                    </div>
                  </div>

                  <div class="card bg-base-100 shadow-xl mt-4">
                    <div class="card-body">
                      <h2 class="card-title text-sm">
                        การปิดการตั้งค่า และจัดเก็บคุกกี้
                      </h2>
                      <p>
                        ท่านสามารถปิดการตั้งค่าคุกกี้ได้
                          โดยการปรับการตั้งค่าในเบราว์เซอร์ของท่าน
                          แต่ในการปิดการใช้งานคุกกี้จะส่งผลต่อการทำงานของเว็บไซต์นี้
                          และเว็บไซต์อื่น ๆ ที่ท่านเข้าใช้งาน
                          อาจจะมีการปิดใช้งานฟังก์ชันและคุณสมบัติการทำงานบางอย่างของเว็บไซต์นี้ด้วย
                          
                          
                          
                          
                          
                      </p>
                    </div>
                  </div>

                  <div class="card bg-base-100 shadow-xl mt-4">
                    <div class="card-body">
                      <h2 class="card-title text-sm">การเชื่อมโยงข้อมูลกับเว็บไซต์อื่น</h2>
                      <p>
                        
                        เป็นต้น
                            ซึ่งจะช่วยให้ท่านเข้าถึงเนื้อหาและสร้างการปฏิสัมพันธ์กับบุคคลอื่นบนโซเชียลมีเดียจากเว็บไซต์ของ
                            Me Verse (สสส.) ได้
                            ซึ่งเว็บไซต์หรือโซเชียลมีเดียของบุคคลภายนอกจะมีการกำหนดและตั้งค่าคุกกี้ขึ้นมาเอง
                            โดยที่ Me Verse (สสส.)
                            ไม่สามารถควบคุมหรือรับผิดชอบต่อคุกกี้เหล่านั้นได้
                            และขอแนะนำให้ท่านควรเข้าไปอ่านและศึกษานโยบายหรือประกาศการใช้คุกกี้ของบุคคลภายนอกเหล่านั้นด้วย
                      </p>
                    </div>
                  </div>

                  <div class="card-body">
                      <h2 class="card-title text-orange-500 my-5 mt-10">การเปลี่ยนแปลงนโยบายคุกกี้</h2>
                      <p>
                        นโยบายนี้อาจมีการปรับปรุงให้เหมาะสมและสอดคล้องกับสถานการณ์และการให้บริการจริงโดย Me Verse (สสส.)
                          จะมีการแจ้งการปรับปรุงนโยบายใหม่บนเว็บไซต์นี้ ดังนั้น
                          Me Verse (สสส.)
                          ขอแนะนำให้ท่านตรวจสอบให้แน่ใจว่าท่านได้เข้าใจการเปลี่ยนแปลงดังกล่าว
                      </p>
                    </div>
                    
                    
            <div class="divider"></div>
                  <div class="card-body ">
                      <h2 class="card-title text-orange-500 my-5 mt-10">การติดต่อ Me Verse (สสส.)</h2>
                      <p>
                        ในกรณีที่ท่านมีคำถามเกี่ยวกับนโยบายคุกกี้ของ สสส.
                          ท่านสามารถติดต่อสอบถามไปยัง สสส. ตามช่องทาง ดังต่อไปนี้
                      </p>
                      <ul class="menu bg-base-100"><li><a href="#">
                        <p class="text-left">
                        1. ผู้ควบคุมข้อมูลส่วนบุคคล<br/>Me Verse ( สสส. )<br/>เลขที่ 99/8 ซอยงามดูพลี แขวงทุ่งมหาเมฆ เขตสาทร
                          กรุงเทพมหานคร 10120<br/>โทร. 0 2343 1500<br/>อีเมล : dpo@thaihealth.or.th
                        </p>
                        
</a>

</li>
<li><a href="#">
 
  
  
  <p class="text-left">
    2. เจ้าหน้าที่คุ้มครองข้อมูลส่วนบุคคล <br/> 
    นาย วิเชียร ทิพย์ชุมภู<br/>เลขที่ 99/8 ซอยงามดูพลี แขวงทุ่งมหาเมฆ เขตสาทร
                          กรุงเทพมหานคร 10120<br/>โทร. 0 2343 1500 <br/> อีเมล : dpo@thaihealth.or.th
                        </p>
</a></li>
</ul>
                    </div>
                </section>
              </div>
            </div>
          </div>
        </div>
      </div>
    </div>
  </div>
</template>
  
  <script>
export default {
  name: "CookiePolicy",
  data() {
    return {};
  },
  computed: {},
  methods: {},
  mounted() {},
  beforeDestroy() {},
  watch: {},
};
</script>