<template>
  <div class="PrivacyPolicy" data-theme="wireframe">
    <div class="hero min-auto" ref="home" id="home">
      <div class="hero-overlay bg-dark bg-opacity-0 z-10 min-h-screen"></div>
      <div class="hero-content flex-col lg:flex-row-reverse w-full">
        <div class="container">
          <div class="text-center lg:text-center">
            <div class="text-4xl lg:text-5xl font-bold mt-6" ref="text">
              Privacy Policy
            </div>
            <div class="divider text-orange-500">ประกาศ Me Verse</div>
            <div class="container">
              <span class="text-orange-500 my-5">
                เรื่อง นโยบายการคุ้มครองข้อมูลส่วนบุคคล
              </span>

              <div>
                <section class="container text-left text-sm">
                  <div class="card bg-base-100 shadow-xl">
                    <div class="card-body">
                      <!-- <h2 class="card-title text-sm">1. วัตถุประสงค์</h2> -->
                      <p>
                        โดยที่พระราชกฤษฎีกากำหนดหลักเกณฑ์และวิธีการในการทำธุรกรรมทางอิเล็กทรอนิกส์ภาครัฐ
                        พ.ศ. ๒๕๔๙
                        บัญญัติให้หน่วยงานของรัฐต้องจัดทำแนวนโยบายและแนวปฏิบัติการคุ้มครองข้อมูลส่วนบุคคล
                        และประกาศคณะกรรมการธุรกรรมทางอิเล็กทรอนิกส์ เรื่อง
                        แนวนโยบายและแนวปฏิบัติในการคุ้มครองข้อมูลส่วนบุคคลของหน่วยงานของรัฐ
                        พ.ศ. ๒๕๕๓ ประกอบกับพระราชบัญญัติคุ้มครองข้อมูลส่วนบุคคล
                        พ.ศ. ๒๕๖๒ ได้กำหนดมาตรการในการคุ้มครองข้อมูลส่วนบุคคล
                        ดังนั้น เพื่อให้การดำเนินการคุ้มครองข้อมูลส่วนบุคคลของ
                        Me Verse (สสส.) เป็นไปอย่างมีประสิทธิภาพ
                        สามารถปฏิบัติตามได้อย่างเป็นรูปธรรม
                        จึงกำหนดนโยบายการคุ้มครองข้อมูลส่วนบุคคลของ Me Verse
                        (สสส.) ไว้ดังต่อไปนี้
                      </p>

                      <div class="divider"></div>
                      ๑ .การเก็บรวบรวมข้อมูลส่วนบุคคลอย่างจำกัด
                      <br />
                      Me Verse (สสส.) จะเก็บรวบรวมข้อมูลส่วนบุคคล “เท่าที่จำเป็น”
                      สำหรับการให้บริการตามวัตถุประสงค์ในการดำเนินงานของ Me Verse (สสส.)
                      และภายใต้วัตถุประสงค์ที่กำหนดไว้ในพระราชบัญญัติคุ้มครองข้อมูลส่วนบุคคล
                      พ.ศ. ๒๕๖๒ อย่างเคร่งครัด และ Me Verse (สสส.)
                      จะขอความยินยอมจากเจ้าของข้อมูลส่วนบุคคลก่อนหรือขณะที่เก็บรวบรวมข้อมูลส่วนบุคคล
                      เว้นแต่เป็นกรณีที่กฎหมายกำหนด
                      และจะรักษาข้อมูลเหล่านั้นไว้เป็นความลับตามเกณฑ์มาตรฐานการกําหนดชั้นความลับของข้อมูลของ
                      Me Verse (สสส.)
                      <div class="divider"></div>
                      ๒. วัตถุประสงค์ในการเก็บรวบรวม ใช้ เปิดเผย
                      <!-- <br /> -->
                      <ul class="menu bg-base-100">
                        <li>
                          <a href="#">
                            <p class="text-left">
                              ๒.๑ Me Verse (สสส.) จะเก็บรวบรวม ใช้
                              และเปิดเผยข้อมูลส่วนบุคคลของเจ้าของข้อมูลส่วนบุคคล
                              เพื่อการดำเนินงานในพันธกิจต่าง ๆ ของ Me Verse (สสส.)
                              รวมทั้งเพื่อการศึกษาวิจัยหรือการจัดทำสถิติที่เป็นไปตามวัตถุประสงค์การดำเนินงานของ
                              Me Verse (สสส.) ตามที่กฎหมายกำหนด
                            </p>
                          </a>
                        </li>
                        <li>
                          <a href="#">
                            <p class="text-left">
                              ๒.๒ Me Verse (สสส.)
                              จะบันทึกวัตถุประสงค์ของการเก็บรวบรวมข้อมูลส่วนบุคคลในขณะที่มีการรวบรวมและจัดเก็บ
                              รวมถึงการนำข้อมูลนั้นไปใช้ในภายหลัง
                              และหากมีการเปลี่ยนแปลงวัตถุประสงค์ของการเก็บรวบรวมข้อมูล
                              Me Verse (สสส.) จะจัดทำบันทึกแก้ไขเพิ่มเติมไว้เป็นหลักฐาน
                              หากมีการเปลี่ยนแปลงวัตถุประสงค์ตามที่เคยได้แจ้งไว้
                              Me Verse (สสส.)
                              จะแจ้งวัตถุประสงค์ใหม่นั้นให้กับเจ้าของข้อมูลส่วนบุคคลทราบและได้รับความยินยอมก่อนเก็บรวบรวม
                              ใช้ หรือเปิดเผย
                              เว้นแต่ได้รับยกเว้นไม่ต้องขอความยินยอมตามที่กฎหมายกำหนด
                            </p>
                          </a>
                        </li>
                      </ul>

                      <div class="divider"></div>
                      ๓. ข้อจำกัดในการนำข้อมูลส่วนบุคคลไปใช้
                      <ul class="menu bg-base-100">
                        <li>
                          <a href="#">
                            <p class="text-left">
                              ๓.๑ Me Verse (สสส.)
                              จะกำกับดูแลไม่ให้ผู้ที่ไม่มีหน้าที่หรือไม่ได้รับมอบหมายนำข้อมูลส่วนบุคคลไปใช้ประโยชน์
                              เปิดเผย แสดง
                              หรือทำให้ปรากฏในลักษณะอื่นใดแก่บุคคลอื่น
                              นอกเหนือวัตถุประสงค์ที่ได้ขอความยินยอมจากเจ้าของข้อมูลส่วนบุคคล
                              เว้นแต่การใช้ข้อมูลส่วนบุคคลที่ได้รับยกเว้นไม่ต้องขอความยินยอมตามที่กฎหมายกำหนด
                            </p>
                          </a>
                        </li>
                        <li>
                          <a href="#">
                            <p class="text-left">
                              ๓.๒ Me Verse (สสส.) อาจเปิดเผยข้อมูลส่วนบุคคลของเจ้าของข้อมูล
                              ภายใต้หลักเกณฑ์ที่กฎหมายกำหนด เช่น<br />การเปิดเผยต่อหน่วยงานราชการ
                              หน่วยงานภาครัฐ หน่วยงานที่กำกับดูแล
                              รวมถึงในกรณีที่มีการร้องขอให้เปิดเผยข้อมูลโดยอาศัยอำนาจตามกฎหมาย
                            </p>
                          </a>
                        </li>
                        <li>
                          <a href="#">
                            <p class="text-left">
                              ๓.๓ Me Verse (สสส.) อาจใช้เทคโนโลยีคุกกี้ (Cookies)
                              เพื่อเก็บรวบรวมข้อมูลพฤติกรรมของเจ้าของข้อมูลส่วนบุคคล
                              เกี่ยวกับการเข้าถึง การใช้งาน
                              หรือการรับบริการผ่านเว็บไซต์และแอปพลิเคชันของ Me Verse (สสส.)
                              เพื่อประโยชน์<br />ในการอำนวยความสะดวกแก่เจ้าของข้อมูลส่วนบุคคล
                              ในการเข้าถึง การใช้งาน
                              หรือการรับบริการผ่านเว็บไซต์และแอปพลิเคชันของ Me Verse (สสส.)
                            </p>
                          </a>
                        </li>
                      </ul>
                      <div class="divider"></div>
                      ๔. การรักษาความมั่นคงปลอดภัย
                      <ul class="menu bg-base-100">
                        <li>
                          <a href="#">
                            <p class="text-left">
                              ๔.๑ Me Verse (สสส.)
                              จะกำหนดมาตรการในการรักษาความมั่นคงปลอดภัยของข้อมูลส่วนบุคคลอย่างเหมาะสม
                              เพื่อป้องกันการสูญหาย การเข้าถึง ใช้ เปลี่ยนแปลง
                              แก้ไข หรือเปิดเผยข้อมูลส่วนบุคคล
                              โดยผู้ที่ไม่มีสิทธิหรือโดยไม่ชอบด้วยกฎหมาย
                            </p>
                          </a>
                        </li>
                        <li>
                          <a href="#">
                            <p class="text-left">
                              ๔.๒ Me Verse (สสส.)
                              จะดำเนินการลบหรือทำลายข้อมูลส่วนบุคคลเมื่อพ้นกำหนดระยะเวลาการเก็บหรือหมดความจำเป็นตามวัตถุประสงค์ในการเก็บรวบรวมข้อมูลส่วนบุคคล
                              หรือเมื่อเจ้าของข้อมูลส่วนบุคคลร้องขอหรือเจ้าของข้อมูลส่วนบุคคลได้เพิกถอนความยินยอม
                              เว้นแต่การเก็บรักษาข้อมูลส่วนบุคคลที่ได้รับยกเว้นไม่ต้องขอความยินยอมตามที่กฎหมายกำหนด
                            </p>
                          </a>
                        </li>
                      </ul>

                      <div class="divider"></div>

                      ๕. การมีส่วนร่วมของเจ้าของข้อมูล
                      <br />
                      Me Verse (สสส.)
                      จะเก็บรวบรวมข้อมูลส่วนบุคคลจากเจ้าของข้อมูลส่วนบุคคลโดยตรงเท่านั้น
                      และต้อง
                      “ขอความยินยอมจากเจ้าของข้อมูลส่วนบุคคลก่อนหรือระหว่างเก็บรวบรวมข้อมูลส่วนบุคคล”
                      เว้นแต่การเก็บรวบรวมข้อมูลส่วนบุคคลที่ได้รับยกเว้นไม่ต้องขอความยินยอมตามที่กฎหมายกำหนด
                      หาก Me Verse (สสส.) จำเป็นต้อง
                      “เก็บรวบรวมข้อมูลส่วนบุคคลจากแหล่งอื่น”
                      ที่ไม่ใช่เก็บจากเจ้าของข้อมูลส่วนบุคคลโดยตรง Me Verse (สสส.)
                      จะแจ้งเหตุผลความจำเป็นนั้นให้เจ้าของข้อมูลส่วนบุคคลทราบและต้องขอความยินยอมในเวลาไม่เกิน
                      ๓๐ วันนับแต่วันเริ่มดำเนินการเก็บรวบรวมข้อมูลส่วนบุคคล
                      เว้นแต่การเก็บรวบรวมข้อมูลส่วนบุคคลที่ได้รับยกเว้นไม่ต้องขอความยินยอมตามที่กฎหมายกำหนด

                      <div class="divider"></div>
                      ๖. สิทธิของเจ้าของข้อมูลส่วนบุคคล<br />
                      เจ้าของข้อมูลส่วนบุคคลมีสิทธิในการดำเนินการ ดังต่อไปนี้
                      <ul class="menu bg-base-100">
                        <li>
                          <a href="#">
                            <p class="text-left">
                              ๖.๑ สิทธิ “เพิกถอนความยินยอม”
                              ในการประมวลผลข้อมูลส่วนบุคคลที่เคยให้ไว้แก่ Me Verse (สสส.)
                              ได้ตามที่กฎหมายกำหนด
                            </p>
                          </a>
                        </li>
                        <li>
                          <a href="#">
                            <p class="text-left">
                              ๖.๒ สิทธิในการ “เข้าถึง” ข้อมูลส่วนบุคคลของตนเอง
                              และอาจขอให้ Me Verse (สสส.)
                              ทำสำเนาข้อมูลส่วนบุคคลดังกล่าวให้แก่ตนเอง
                              รวมถึงขอให้เปิดเผยการได้มาซึ่งข้อมูลส่วนบุคคลที่เจ้าของข้อมูลส่วนบุคคลไม่ได้ให้ความยินยอมได้
                            </p>
                          </a>
                        </li>
                        <li>
                          <a href="#">
                            <p class="text-left">
                              ๖.๓ สิทธิ “คัดค้าน” การเก็บรวบรวม ใช้
                              หรือเปิดเผยข้อมูลส่วนบุคคลของตนเองด้วยเหตุบางประการตามที่กฎหมายกำหนด
                            </p>
                          </a>
                        </li>
                        <li>
                          <a href="#">
                            <p class="text-left">
                              ๖.๔ สิทธิขอให้ “ลบ” โดยขอให้ Me Verse (สสส.) ดำเนินการลบ
                              หรือทำลาย
                              หรือทำให้ข้อมูลส่วนบุคคลเป็นข้อมูลที่ไม่สามารถระบุตัวบุคคลที่เป็นเจ้าของข้อมูลส่วนบุคคลได้
                              ด้วยเหตุบางประการได้ตามที่กฎหมายกำหนด
                            </p>
                          </a>
                        </li>
                        <li>
                          <a href="#">
                            <p class="text-left">
                              ๖.๕ สิทธิขอให้ “ระงับการใช้” โดยขอให้ Me Verse (สสส.)
                              ระงับการใช้ข้อมูลส่วนบุคคลของตนเองด้วยเหตุบางประการตามที่กฎหมายกำหนด
                            </p>
                          </a>
                        </li>
                        <li>
                          <a href="#">
                            <p class="text-left">
                              ๖.๖ สิทธิขอให้ “แก้ไขเปลี่ยนแปลง” โดยขอให้ Me Verse (สสส.)
                              ดำเนินการให้ข้อมูลส่วนบุคคลนั้นถูกต้องเป็นปัจจุบัน
                              สมบูรณ์ และไม่ก่อให้เกิดความเข้าใจผิด
                            </p>
                          </a>
                        </li>
                      </ul>

                      <div class="divider"></div>
                      ๗.การเปิดเผยเกี่ยวกับการดำเนินการ
                      แนวปฏิบัติและนโยบายที่เกี่ยวกับข้อมูลส่วนบุคคล
                      <ul class="menu bg-base-100">
                        <li>
                          <a href="#">
                            <p class="text-left">
                              ๗.๑ Me Verse (สสส.)
                              มีการดำเนินการตามนโยบายการคุ้มครองข้อมูลส่วนบุคคลของ
                              Me Verse (สสส.) โดยจะเผยแพร่ผ่านทางเว็บไซต์
                              รวมทั้งหากมีการปรับปรุงแก้ไขนโยบายการคุ้มครองข้อมูลส่วนบุคคล
                              ก็จะดำเนินการเผยแพร่ผ่านช่องทางดังกล่าว
                              รวมทั้งผ่านสื่อที่ Me Verse (สสส.)
                              ใช้เพื่อการประชาสัมพันธ์ตามความเหมาะสมด้วย
                            </p>
                          </a>
                        </li>
                        <li>
                          <a href="#">
                            <p class="text-left">
                              ๗.๒ การดำเนินการ แนวปฏิบัติ
                              และนโยบายที่เกี่ยวกับการคุ้มครองข้อมูลส่วนบุคคลที่
                              Me Verse (สสส.) ประกาศใช้นี้ จะใช้เฉพาะสำหรับการเก็บรวบรวม
                              ใช้ หรือเปิดเผยข้อมูลส่วนบุคคลในกิจการของ Me Verse (สสส.)
                              ซึ่งรวมตลอดถึงการบริหารงาน การให้บริการ
                              และการเข้าถึงเว็บไซต์ของ Me Verse (สสส.) เท่านั้น
                              หากผู้ใช้บริการมีการเชื่อมโยง
                              ไปยังเว็บไซต์อื่นผ่านทางเว็บไซต์ของ Me Verse (สสส.)
                              ผู้ใช้บริการจะต้องศึกษาและปฏิบัติตามนโยบายและแนวปฏิบัติในการคุ้มครองข้อมูลส่วนบุคคลตามที่ปรากฏในเว็บไซต์อื่นนั้นแยกต่างหากจาก
                              Me Verse (สสส.) ด้วย
                            </p>
                          </a>
                        </li>
                      </ul>

                      <div class="divider"></div>
                      ๘. Me Verse (สสส.)
                      จัดให้มีช่องทางการติดต่อสำหรับเจ้าของข้อมูลส่วนบุคคล
                      และผู้ใช้บริการ ดังต่อไปนี้
                      <br />

                      <!-- <div class="card-body "> -->
                      <!-- <h2 class="card-title text-orange-500 my-5 mt-10">การติดต่อ Me Verse (สสส.)</h2> -->
                      <!-- <p>
                        ในกรณีที่ท่านมีคำถามเกี่ยวกับนโยบายคุกกี้ของ สสส.
                          ท่านสามารถติดต่อสอบถามไปยัง สสส. ตามช่องทาง ดังต่อไปนี้
                      </p> -->
                      <ul class="menu bg-base-100">
                        <li>
                          <a href="#">
                            <p class="text-left">
                              ๘.๑. ผู้ควบคุมข้อมูลส่วนบุคคล<br />Me
                              Verse(สสส.)<br />เลขที่ ๙๙/๘ ซอยงามดูพลี
                              แขวงทุ่งมหาเมฆ เขตสาทร กรุงเทพมหานคร ๑๐๑๒๐<br />โทรศัพท์.
                              ๐ ๒๓๔๓ ๑๕๐๐<br />E-mail : dpo@thaihealth.or.th<br />Website
                              : www.thaihealth.or.th
                            </p>
                          </a>
                        </li>
                        <li>
                          <a href="#">
                            <p class="text-left">
                              ๘.๒. รายละเอียดของหน่วยงานกำกับดูแล ในกรณีที่ Me Verse (สสส.)
                              หรือเจ้าหน้าที่หรือลูกจ้าง หรือผู้ปฏิบัติงานของ
                              Me Verse (สสส.)
                              ฝ่าฝืนหรือไม่ปฏิบัติตามกฎหมายเกี่ยวกับการคุ้มครองข้อมูลส่วนบุคคล
                              โดยสามารถร้องเรียนต่อหน่วยงานกำกับดูแลตามรายละเอียดดังต่อไปนี้<br />
                              สำนักงานคณะกรรมการคุ้มครองข้อมูลส่วนบุคคล<br />
                              สำนักงานปลัดกระทรวงดิจิทัลเพื่อเศรษฐกิจและสังคม
                            </p>
                          </a>
                        </li>
                      </ul>
                    </div>
                  </div>
                </section>
              </div>
            </div>
          </div>
        </div>
      </div>
    </div>
  </div>
</template>

<script>
export default {
  name: "PrivacyPolicy",
  data() {
    return {};
  },
  computed: {},
  methods: {},
  mounted() {},
  beforeDestroy() {},
  watch: {},
};
</script>