<template>
  <div class="TermsConditions" data-theme="wireframe">
    <div class="hero min-auto" ref="home" id="home">
      <div class="hero-overlay bg-dark bg-opacity-0 z-10 min-h-screen"></div>
      <div class="hero-content flex-col lg:flex-row-reverse w-full">
        <div class="container">
          <div class="text-center lg:text-center">
            <div class="text-4xl lg:text-5xl font-bold mt-6" ref="text">
              Terms & Confitions
            </div>
            <div class="divider text-orange-500">ประกาศ Me Verse</div>
            <div class="container">
              <span class="text-orange-500 my-5">
                เรื่อง ข้อตกลงและเงื่อนไข Me Verse
              </span>
              <div>
                <section class="container text-left text-sm">
                  <div class="card bg-base-100 shadow-xl">
                    <div class="card-body">
                      <h2 class="card-title text-sm">1. วัตถุประสงค์</h2>
                      <p>
                        เว็บไซต์ Me Verse
                        จัดทำขึ้นเพื่อให้บริการในการใช้บริการข้อมูลข่าวสารแก่ประชาชนทั่วไป
                        และบุคลากร ในสำนักงานกองทุน<br />Me Verse
                        การใช้บริการเว็บไซต์ของผู้ใช้บริการจะอยู่ภายใต้เงื่อนไขและข้อกำหนดดังต่อไปนี้
                        ผู้ใช้บริการจึงควรศึกษาเงื่อนไข
                        และข้อกำหนดการใช้งานเว็บไซต์ และ/หรือ เงื่อนไข
                        และข้อตกลงอื่นใดที่ Me Verse ได้แจ้งให้ทราบบนเว็บไซต์
                        โดยละเอียดก่อนการเข้าใช้บริการทั้งนี้ในการใช้บริการ
                        ให้ถือว่าผู้ใช้บริการได้ตกลงที่จะปฏิบัติตามเงื่อนไข
                        และข้อกำหนดการ ให้บริการที่กำหนดไว้นี้
                        หากผู้ใช้บริการไม่ประสงค์ที่จะผูกพันตามข้อกำหนด
                        และเงื่อนไขการให้บริการข้อความกำหนดการให้บริการกรุณาท่านยุติการเข้าชม
                        และใช้งานเว็บไซต์นี้ในทันที
                      </p>
                    </div>
                  </div>

                  <div class="card bg-base-100 shadow-xl mt-4">
                    <div class="card-body">
                      <h2 class="card-title text-sm">
                        2. เงื่อนไขและข้อกำหนดการใช้งานเว็บไซต์
                      </h2>
                      <p>
                        ผู้ใช้บริการอาจได้รับ เข้าถึง สร้าง ส่ง หรือแสดงข้อมูล
                        เช่น ไฟล์ข้อมูล ข้อความลายลักษณ์อักษร
                        ซอฟต์แวร์คอมพิวเตอร์ดนตรี ไฟล์เสียง หรือเสียงอื่นๆ
                        ภาพถ่าย วิดีโอ หรือรูปภาพอื่นๆ
                        โดยเป็นส่วนหนึ่งของบริการหรือโดยผ่านการใช้บริการซึ่งต่อไปนี้จะเรียกว่า“เนื้อหา”
                        <br />
                        เนื้อหาที่นำเสนอต่อผู้ใช้บริการอาจได้รับการคุ้มครองโดยสิทธิในทรัพย์สินทางปัญญาของเจ้าของเนื้อหานั้นผู้ใช้บริการไม่มีสิทธิเปลี่ยนแปลงแก้ไข
                        จำหน่ายจ่ายโอนหรือสร้างผลงานต่อเนื่องโดยอาศัยเนื้อหาดังกล่าว
                        ไม่ว่าจะทั้งหมด
                        หรือบางส่วนเว้นแต่ผู้ใช้บริการจะได้รับอนุญาตโดยชัดแจ้งจากเจ้าของเนื้อหานั้น
                        <br />
                        ผู้ใช้บริการอาจพบเนื้อหาที่ไม่เหมาะสม
                        หรือหยาบคายอันก่อให้เกิดความไม่พอใจภายใต้ความเสี่ยงของตนเอง
                        <br />
                        Me Verse ทรงไว้ซึ่งสิทธิในการคัดกรองตรวจทาน
                        ทำเครื่องหมายเปลี่ยนแปลงแก้ไขปฏิเสธใดๆที่ไม่เหมาะสมออกจากบริการซึ่ง
                        Me Verse อาจจัดเตรียมเครื่องมือในการคัดกรองเนื้อหา
                        อย่างชัดเจนโดยไม่ขัดต่อกฎหมายกฎระเบียบของทางราชการที่เกี่ยวข้อง
                        <br />
                        Me Verse อาจหยุดให้บริการเป็นการชั่วคราว
                        หรือถาวรหรือยกเลิกการให้บริการแก่ผู้ใช้บริการรายใด
                        เป็นการเฉพาะหากการให้บริการดังกล่าวส่งผลกระทบ
                        ต่อผู้ใช้บริการอื่นๆหรือขัดแย้งต่อกฎหมาย
                        โดยไม่ต้องแจ้งให้ผู้ใช้บริการทราบล่วงหน้าการหยุด
                        หรือการยกเลิกบริการตาม ข้อ 2.5
                        ผู้ใช้บริการจะไม่สามารถเข้าใช้บริการ
                        และเข้าถึงรายละเอียดบัญชี ของผู้ใช้บริการไฟล์เอกสารใดๆ
                        หรือเนื้อหาอื่นๆ ที่อยู่ในบัญชีของผู้ใช้บริการได้
                        <br />
                        ในกรณี ที่ Me Verse หยุดให้บริการเป็นการถาวร
                        หรือยกเลิกบริการแก่ผู้ใช้บริการ Me Verse มีสิทธิ
                        ในการลบข้อมูลต่างๆ
                        ที่อยู่ในบัญชีของผู้ใช้บริการได้โดยไม่ต้องแจ้งให้ผู้ใช้บริการทราบล่วงหน้า
                      </p>
                    </div>
                  </div>

                  <div class="card bg-base-100 shadow-xl mt-4">
                    <div class="card-body">
                      <h2 class="card-title text-sm">
                        3. สิทธิ หน้าที่ และความรับผิดชอบของผู้ใช้บริการ
                      </h2>
                      <p>
                        ผู้ใช้บริการจะให้ข้อมูลเกี่ยวกับตนเอง
                        เช่นข้อมูลระบุตัวตนหรือรายละเอียดการติดต่อที่ถูกต้องเป็นจริงและเป็นปัจจุบันเสมอแก่
                        Me Verse
                        อันเป็นส่วนหนึ่งของกระบวนการลงทะเบียนใช้บริการหรือการใช้บริการที่ต่อเนื่อง
                        <br />
                        ผู้ใช้บริการจะใช้บริการเว็บไซต์นี้เพื่อวัตถุประสงค์ที่ได้รับอนุญาตตามข้อกำหนดของ
                        Me Verse และไม่ขัดต่อกฎหมาย กฎ ระเบียบ ข้อบังคับ
                        หลักปฏิบัติที่เป็นที่ยอมรับโดยทั่วไป<br />ผู้ใช้บริการจะไม่เข้าใช้
                        หรือพยายามเข้าใช้บริการหนึ่งบริการใดโดยวิธีอื่นรวมถึงการใช้วิธีการอัตโนมัติ
                        (การใช้สคริปต์) นอกจากช่องทางที่ Me Verse
                        จัดเตรียมไว้ให้ เว้นแต่ผู้ใช้บริการจะได้รับอนุญาตจาก Me
                        Verse โดยชัดแจ้งให้ทำเช่นนั้นได้<br />ผู้ใช้บริการจะไม่ทำ
                        หรือมีส่วนร่วมในการขัดขวาง หรือรบกวนบริการของ Me Verse
                        รวมทั้งเรื่องแม่ข่าย
                        และเครือข่ายที่เชื่อมต่อกับบริการ<br />ผู้ใช้บริการจะไม่ทำสำเนา
                        คัดลอก ทำซ้ำ ขาย แลกเปลี่ยน
                        หรือขายต่อบริการเพื่อวัตถุประสงค์ใดๆ
                        เว้นแต่ผู้ใช้บริการจะได้รับอนุญาตจาก Me Verse
                        โดยชัดแจ้งให้ทำเช่นนั้นได้
                        <br />ผู้ใช้บริการมีหน้าที่ในการรักษาความลับของรหัสผ่านที่เชื่อมโยงกับบัญชีใดๆที่ใช้ในการเข้าถึงบริการ<br />
                        ผู้ใช้บริการจะเป็นผู้รับผิดชอบ
                        แต่เพียงผู้เดียวต่อบุคคลใดๆ รวมถึง Me Verse
                        ในความเสียหายอันเกิดจากการละเมิดข้อกำหนด
                      </p>
                    </div>
                  </div>

                  <div class="card bg-base-100 shadow-xl mt-4">
                    <div class="card-body">
                      <h2 class="card-title text-sm">
                        4. การเชื่อมโยงกับเว็บไซต์อื่นๆ
                      </h2>
                      <p>
                        การเชื่อมโยงไปยังเว็บไซต์อื่นเป็นเพียงการให้บริการเพื่ออำนวยความสะดวกแก่ผู้ใช้บริการเท่านั้น
                        Me Verse
                        มิได้มีส่วนเกี่ยวข้องหรือมีอำนาจควบคุมรับรองความถูกต้องความน่าเชื่อถือตลอดจนความรับผิดชอบในเนื้อหาข้อมูลของเว็บไซต์นั้นๆและ
                        Me Verse ไม่รับผิดชอบต่อเนื้อหาใดๆ
                        ที่แสดงบนเว็บไซต์อื่นที่เชื่อมโยงมายังเว็บไซต์ของ Me
                        Verse
                        หรือต่อความเสียหายใดๆที่เกิดขึ้นจากการเข้าเยี่ยมชมเว็บไซต์ดังกล่าวการเชื่อมโยงมายังเว็บไซต์
                        Me Verse
                        <br />กรณีต้องการเชื่อมโยงมายังเว็บไซต์ของ Me Verse
                        ผู้ใช้บริการสามารถเชื่อมโยงมายังหน้าแรก ของ เว็บไซต์ของ
                        Me Verse ได้โดยแจ้งความประสงค์เป็นหนังสือ
                        แต่หากต้องการเชื่อมโยง
                        มายังหน้าภายในของเว็บไซต์นี้จะต้องได้รับความยินยอมเป็นหนังสือจาก
                        Me Verse แล้วเท่านั้นและในการให้ความยินยอมดังกล่าว Me
                        Verse
                        ขอสงวนสิทธิ์ที่จะกำหนดเงื่อนไขใดๆไว้ด้วยก็ได้ในการที่เว็บไซต์อื่นที่เชื่อมโยงมายังเว็บไซต์ของ
                        Me Verse จะไม่รับผิดชอบต่อเนื้อหาใดๆที่แสดงบนเว็บไซต์
                        ที่เชื่อมโยงมายังเว็บไซต์ของความเสียหายใดๆ
                        ที่เกิดขึ้นจากการใช้เว็บไซต์เหล่านั้น
                      </p>
                    </div>
                  </div>

                  <div class="card bg-base-100 shadow-xl mt-4">
                    <div class="card-body">
                      <h2 class="card-title text-sm">5. การปฏิเสธความรับผิด</h2>
                      <p>
                        Me Verse
                        จะไม่รับผิดต่อความเสียหายใดๆรวมถึงความเสียหายสูญเสียและค่าใช้จ่ายที่เกิดขึ้นไม่ว่าโดยตรงหรือโดยอ้อมที่เป็นผลหรือสืบเนื่องจากการที่ผู้ใช้เข้าใช้เว็บไซต์นี้
                        หรือเว็บไซต์ที่เชื่อมโยงกับเว็บไซต์นี้
                        หรือต่อความเสียหาย สูญเสีย
                        หรือค่าใช้จ่ายที่เกิดจากความล้มเหลวในการใช้งาน
                        ความผิดพลาด การละเว้น การหยุดชะงัก
                        ข้อบกพร่องความไม่สมบูรณ์คอมพิวเตอร์ไวรัส ถึงแม้ว่า Me
                        Verse
                        จะได้รับแจ้งว่าอาจจะเกิดความเสียหายสูญเสียหรือค่าใช้จ่ายดังกล่าวขึ้น
                        นอกจากนี้ Me Verse
                        ไม่รับผิดต่อผู้ใช้เว็บไซต์หรือบุคคลจากการเรียกร้องใดๆที่เกิดขึ้นจากบนเว็บไซต์
                        หรือเนื้อหาใดๆ ซึ่งรวมถึงการตัดสินใจหรือการกระทำใด ๆ
                        ที่เกิดจากความเชื่อถือในเนื้อหาดังกล่าวของผู้ใช้เว็บไซต์
                        หรือในความเสียหายใดๆ ไม่ว่าความเสียหายทางตรง
                        หรือทางอ้อมรวมถึงความเสียหายอื่นใดที่อาจเกิดขึ้นได้ผู้ใช้บริการยอมรับ
                        และตระหนักดีว่า Me Verse
                        จะไม่ต้องรับผิดชอบต่อการกระทำใดของผู้ใช้บริการทั้งสิ้น
                      </p>
                    </div>
                  </div>

                  <div class="card bg-base-100 shadow-xl mt-4">
                    <div class="card-body">
                      <h2 class="card-title text-sm">
                        6. กรรมสิทธิ์และสิทธิในทรัพย์สินทางปัญญา
                      </h2>
                      <p>
                        Me Verse หรือผู้ให้อนุญาต แก่ Me Verse
                        เป็นผู้มีสิทธิตามกฎหมายแต่เพียงผู้เดียวในกรรมสิทธิ์ผลประโยชน์ทั้งหมดรวมถึงสิทธิในทรัพย์สินทางปัญญาใดๆที่มีอยู่ในบริการซึ่ง
                        Me Verse หรือผู้ให้อนุญาตแก่ Me Verse
                        เป็นผู้จัดทำขึ้นไม่ว่าสิทธิเหล่านั้น
                        จะได้รับการจดทะเบียนไว้หรือไม่ก็ตาม
                        <br />ผู้ใช้บริการจะต้องไม่เปิดเผยข้อมูลที่ Me Verse
                        กำหนดให้เป็นความลับโดยไม่ได้รับความยินยอมเป็นลายลักษณ์อักษรล่วงหน้าจาก
                        Me Verse
                        <br />ผู้ใช้บริการจะต้องไม่ใช้ชื่อทางการค้าเครื่องหมายการค้าเครื่องหมายการบริการตราสัญลักษณ์ชื่อโดเมนของ
                        Me Verse โดยไม่ได้รับความยินยอมเป็นลายลักษณ์อักษรจาก Me
                        Verse
                      </p>
                    </div>
                  </div>
                  <div class="card bg-base-100 shadow-xl mt-4">
                    <div class="card-body">
                      <h2 class="card-title text-sm">7. กฎหมายที่ใช้บังคับ</h2>
                      <p>
                        การตีความ
                        และการบังคับตามเงื่อนไขการให้บริการฉบับนี้ให้เป็นไปตามกฎหมายไทย
                      </p>
                    </div>
                  </div>
                </section>
              </div>
            </div>
          </div>
        </div>
      </div>
    </div>
  </div>
</template>

<script>
export default {
  name: "TermsConditions",
  data() {
    return {};
  },
  computed: {},
  methods: {},
  mounted() {},
  beforeDestroy() {},
  watch: {},
};
</script>