<template>
  <div>
  <input type="checkbox" id="my_modal_7" class="modal-toggle" v-model="test" />
  <div class="modal" role="dialog">
    <div class="modal-box">
      <h3 class="text-lg font-bold">สำเร็จ</h3>
      <p class="py-4">ลงทะเบียนสำเร็จ</p>
    </div>
    <label class="modal-backdrop" for="my_modal_7">Close</label>
  </div>
  <input
    type="checkbox"
    id="modal-base"
    class="modal-toggle"
    v-model="base.modal"
  />
  <div class="modal" v-if="base.modal">
    <div class="modal-box relative w-11/12 max-w-5xl p-2 lg:p-4 max-h-screen">
      <label
        for="modal-base"
        class="btn btn-sm btn-circle absolute right-2 top-2"
        >✕
      </label>
      <h3 class="text-lg font-bold">นโยบายการคุ้มครองข้อมูลส่วนบุคคล<br/>(Data Privacy Policy)</h3>
      <div class="mb-4 main_text_title">
        <div class="sub_first_title text_title mt-5">
บริษัท ยูบิส (เอเชีย) จำกัด (มหาชน) และ บริษัท ยูบิสพรีมาเทค จำกัด
        </div>
      </div>
      <div
        class="card scrollbar-height-1 square scrollbar-cyan bordered-cyan h-80 overflow-auto border"
      >
        <div class="card-body">
          <div class="col-12 text-left">
            <!-- <h6 class="text-darkgreen-2 text-uppercase">
              นโยบายการคุ้มครองข้อมูลส่วนบุคคล (Data Privacy Policy) บริษัท
              ยูบิส (เอเชีย) จำกัด (มหาชน) และ บริษัท ยูบิสพรีมาเทค จำกัด
            </h6> -->
            <p>
              บริษัท ยูบิส (เอเชีย) จำกัด (มหาชน) และ บริษัท ยูบิสพรีมาเทค จำกัด
              (ซึ่งต่อไปในประกาศนี้ เรียกว่า “บริษัทฯ” หรือ “เรา”)
              ตระหนักถึงความสำคัญของการคุ้มครองข้อมูลส่วนบุคคล (Data Privacy)
              ของเจ้าของข้อมูลส่วนบุคคลซึ่งเป็นบุคลากร ลูกจ้าง
              หรือผู้สมัครงานของบริษัทฯ
              อันเป็นสิทธิขั้นพื้นฐานในความเป็นส่วนตัวของบุคคล (Privacy Right)
              ที่ต้องได้รับความคุ้มครองและปฏิบัติตามกฎหมาย
              รวมทั้งกฎเกณฑ์ที่กำหนดขึ้น
              โดยต้องจัดระบบเพื่อควบคุมดุแลอย่างเข้มงวดและรัดกุม
              เพื่อให้ข้อมูลส่วนบุคคลของเจ้าของข้อมูลปลอดภัย
              มีการประมวลผลข้อมูลหรือการเก็บรวบรวม
              ใช้หรือเปิดเผยอย่างโปร่งใสและได้มาตรฐานทางหน่วยงานราชการซึ่งกำกับดูแลกำหนดไว้
              โดยนโยบายความเป็นส่วนตัวนี้
              มีวัตถุประสงค์เพื่อแจ้งให้เจ้าของข้อมูลทราบถึงการปฏิบัติต่อข้อมูลส่วนบุคคลของท่าน
              เช่น การเก็บรวบรวม การใช้ การเปิดเผย รวมถึงสิทธิต่างๆ
              ของเจ้าของข้อมูลข้อมูล เป็นต้น และให้นโยบายฉบับนี้
              มีผลบังคับกับทุกกิจกรรมการดำเนินงานของบริษัทฯ
              ที่เกี่ยวข้องกับข้อมูลส่วนบุคคล
            </p>
            <p class="text-darkgreen-2"><strong>1. คำนิยาม </strong></p>
            <p>ในนโยบายความเป็นส่วนตัวฉบับนี้ คำหรือข้อความว่า</p>
            <p>
              “บริษัทฯ” หมายถึง บริษัท ยูบิส (เอเชีย) จำกัด (มหาชน) และ บริษัท
              ยูบิสพรีมาเทค จำกัด
            </p>
            <p>“บุคคล” หมายถึง บุคคลธรรมดา</p>
            <p>
              “ข้อมูลส่วนบุคคล” หมายถึง
              ข้อมูลเกี่ยวกับบุคคลซึ่งทำให้สามารถระบุตัวบุคคลนั้นได้ไม่ว่าทางตรงหรือทางอ้อม
              แต่ไม่รวมถึงข้อมูลของผู้ถึงแก่กรรมโดยเฉพาะ
            </p>
            <p>
              “ข้อมูลส่วนบุคคลแบบอ่อนไหว” (Sensitive Data) หมายความว่า
              ข้อมูลส่วนบุคคลที่มีความเสี่ยงอาจถูกนำไปสู่การเลือกปฏิบัติอย่างไม่เป็นธรรม
              ในที่นี้หมายถึง เชื้อชาติ ศาสนา พฤติกรรมทางเพศ ประวัติอาชญากรรม
              ข้อมูลส่วนสุขภาพ ความพิการ ข้อมูลพันธุกรรม ข้อมูลชีวภาพ หรืออื่นๆ
              ตามที่กฎหมายกำหนด
            </p>
            <p>
              “บุคคลผู้หย่อนความสามารถ” หมายถึง บุคคลซึ่งเป็นผู้เยาว์
              เป็นคนไร้ความสามารถ
              หรือเสมือนไร้ความสามารถตามประมวลกฎหมายแพ่งและพาณิชย์
            </p>
            <p>
              “เจ้าหน้าที่คุ้มครองข้อมูลส่วนบุคคล” (Data Protection Officer :
              DPO) หมายถึง บุคคลซึ่งบริษัทฯ
              ได้แต่งตั้งให้ทำหน้าที่เป็นเจ้าหน้าที่คุ้มครองข้อมูลส่วนบุคคลตามพระราชบัญญัติคุ้มครองข้อมูลส่วนบุคคล
              พ.ศ.2562
            </p>
            <p>
              “เจ้าของข้อมูลส่วนบุคคล” หมายถึง บุคคลธรรมดาที่เป็นบุคลากร ลูกจ้าง
              หรือผู้สมัครงานและบุคคลที่เกี่ยวข้อง ลูกค้าหรือผู้ใช้บริการ คู่ค้า
              ผู้เข้าเยี่ยมชมเว็ปไซต์ หรือ Mobile Application ของบริษัทฯ
              ตลอดจนผู้บริหารของบริษัทฯ
              และบุคคลใดที่มีนิติสัมพันธ์เกี่ยวข้องกับบริษัทฯ
              โดยต่อไปในนโยบายนี้จะเรียกย่อว่า “เจ้าของข้อมูล”
            </p>
            <p>
              “เว็ปไซต์” หมายถึง เว็ปไซต์ชื่อบริษัทฯ ที่บริษัทฯ
              เป็นเจ้าของหรือให้บริการแล้วแต่กรณี
            </p>
            <p>
              “แอปพลิเคชั่น” หมายถึง แอปพลิเคชั่นซึ่งบริษัทฯ ให้บริการ
              อนึ่งนโยบายคุ้มครองข้อมูลส่วนบุคคลนี้ใช้บังคับกับแอปพลิเคชั่นในส่วนที่ได้มีการเปลี่ยนแปลง
              ปรับปรุง อัพเดท หรือเพิ่มเติมดังกล่าว
              จะถูกบังคับใช้ตามเงื่อนไขและข้อตกลงต่างหากจากนโยบายคุ้มครองข้อมูลส่วนบุคคลนี้
            </p>
            <p>
              “ผู้ควบคุมข้อมูลส่วนบุคคล” หมายถึง บริษัทฯ
              ซึ่งมีอำนาจตัดสินใจเกี่ยวกับข้อมูลส่วนบุคคลนั้น
              ซึ่งได้รับข้อมูลส่วนบุคคลจากเจ้าของข้อมูลหรือให้บริการแก่เจ้าของข้อมูลหรือต้องทำหรือปฏิบัติตามสัญญากับเจ้าของข้อมูล
              ไม่ว่าจะทางตรงหรือทางอ้อมก็ตาม
            </p>
            <p>
              “ผู้ประมวลผลข้อมูลส่วนบุคคล” หมายถึง
              บุคคลธรรมดาหรือนิติบุคคลที่ทำการตัดสินใจเกี่ยวกับการเก็บรวบรวม
              ใช้หรือเปิดเผยข้อมูลส่วนบุคคล
              ตามคำสั่งหรือในนามของอีกบุคคลหรืออีกนิติบุคคลหนึ่ง
            </p>
            <p>“การเก็บรวบรวม” หมายถึง การทำให้ได้มาซึ่งข้อมูลส่วนบุคคล</p>
            <p>
              “การประมวลผลข้อมูล” หมายถึง การดำเนินการใดๆ
              ซึ่งกระทำต่อข้อมูลส่วนบุคคลไม่ว่าจะโดยวิธีการอัตโนมัติหรือไม่ เช่น
              การเก็บรวบรวมการบันทึก การจัดระบบ การเก็บรักษา การใช้ การเปิดเผย
              การเปลี่ยนแปลง หรือการกระทำอื่นใดซึ่งทำให้เกิดความพร้อมใช้งาน
              หรือการผสมเข้าด้วยกัน การลบทำลาย
            </p>
            <p class="text-darkgreen-2"><strong>2. วัตถุประสงค์ </strong></p>
            <p>
              นโยบายความเป็นส่วนตัวนี้
              จัดทำขึ้นเพื่อคุ้มครองข้อมูลส่วนบุคคลของเจ้าของข้อมูลส่วนบุคคล
              ซึ่งทำธุรกรรม ใช้บริการ มีส่วนได้ส่วนเสีย
              หรือมีส่วนเกี่ยวข้องกับบริษัทฯ โดยมีวัตถุประสงค์ดังต่อไปนี้
            </p>
            <p>
              2.1. เพื่อกำหนดบทบาทหน้าที่ของหน่วยงาน ผู้บริหาร บุคลากร
              ซึ่งมีส่วนเกี่ยวข้องกับข้อมูลส่วนบุคคล
            </p>
            <p>
              2.2.
              เพื่อกำหนดขั้นตอนหรือมาตรการรักษาความมั่นคงปลอดภัยหรือมาตรการอื่นใดที่เป็นการคุ้มครองข้อมูลส่วนบุคคลให้สอดคล้องกับที่กฎหมายกำหนด
            </p>
            <p>
              2.3.
              เพื่อกำหนดแนวทางในการปฏิบัติงานของบุคลากรซึ่งเกี่ยวข้องกับการประมวลผล
              หรือการดำเนินงานอื่นใดที่เกี่ยวข้องกับข้อมูลส่วนบุคคล
            </p>
            <p>
              2.4.
              เพื่อสร้างความเชื่อมั่นในการรักษาความมั่นคงปลอดภัยของข้อมูลส่วนบุคคล
              ต่อบุคคล ลูกค้า คู่ค้า ผู้ใช้บริการ ตลอดจนบุคคลอื่นๆ
              ซึ่งมีส่วนได้ส่วนเสียหรือเกี่ยวข้องกับข้อมูลส่วนบุคคล
            </p>
            <p class="text-darkgreen-2">
              <strong>3. การเก็บรวบรวมข้อมูลส่วนบุคคล </strong>
            </p>
            <p>
              การเก็บรวบรวม ใช้ หรือเปิดเผยข้อมูลส่วนบุคคลของบริษัทฯ
              จะต้องสอดคล้องกับหลักการคุ้มครองข้อมูลส่วนบุคคคลกล่าวคือ
            </p>
            <p>
              (1) เป็นการเก็บรวบรวม ใช้
              หรือเปิดเผยข้อมูลส่วนบุคคลโดยชอบด้วยกฎหมาย มีความโปร่งใส
              และสามารถตรวจสอบได้ (Lawfulness, Fairness and Transparency)
            </p>
            <p>
              (2) เป็นการเก็บรวบรวม ใช้
              หรือเปิดเผยข้อมูลส่วนบุคคลภายใต้ขอบเขตและวัตถุประสงค์ที่บริษัทฯ
              กำหนด
              และไม่นำไปใช้หรือเปิดเผยนอกเหนือขอบเขตและวัตถุประสงค์ของการเก็บรวบรวมใช้หรือเปิดเผยข้อมูลนั้น
              (Purpose Limitation)
            </p>
            <p>
              (3) เป็นการเก็บรวบรวม ใช้ หรือเปิดเผยข้อมูลส่วนบุคคลอย่างเพียงพอ
              เกี่ยวข้อง และเท่าที่จำเป็นตามวัตถุประสงค์ของการเก็บรวบรวม ใช้
              หรือเปิดเผยข้อมูลส่วนบุคคล (Data Minimization)
            </p>
            <p>
              (4) เป็นการเก็บรวบรวม ใช้
              หรือเปิดเผยข้อมูลส่วนบุคคลที่ถูกต้องและดำเนินการให้ข้อมูลเป็นปัจจุบันในกรณีที่จำเป็น
              (Accuracy)
            </p>
            <p>
              (5) เป็นการเก็บรวบรวม ใช้
              หรือเปิดเผยข้อมูลส่วนบุคคลตามระยะเวลาเท่าที่จำเป็น (Storage
              Limitation)
            </p>
            <p>
              (6) เป็นการเก็บรวบรวม ใช้
              หรือเปิดเผยข้อมูลส่วนบุคคลที่มีมาตรการรักษาความมั่นคงปลอดภัยของข้อมูลที่เหมาะสม
              (Integrity and
              Confidentiality)พร้อมกับกำหนดระยะเวลาในการจัดเก็บรักษาข้อมูลส่วนบุคคลจากระยะเวลาที่ระบุไว้ในสัญญา
              อายุความตามกฎหมาย หรือกำหนดเวลาอื่นที่กฎหมาย มาตรฐานคุณภาพ
              หรือระเบียบของบริษัทฯ ที่ได้กำหนดไว้ ทั้งนี้
              การเก็บรวบรวมข้อมูลส่วนบุคคล
              จะกระทำภายใต้วัตถุประสงค์และเพียงเท่าที่จำเป็นตามกรอบวัตถุประสงค์หรือเพื่อประโยชน์ที่มีความเกี่ยวข้องโดยตรงกับวัตถุประสงค์ในการเก็บรวบรวม
              โดยจะแจ้งให้เจ้าของข้อมูลทราบก่อนหรือในขณะเก็บรวบรวมข้อมูลส่วนบุคคล
              รวมถึงรายละเอียดดังต่อไปนี้
            </p>
            <p>3.1 บริษัทฯ จะทำการเก็บรวบรวมข้อมูลส่วนบุคคลเพื่อวัตถุประสงค์</p>
            <ol style="list-style: none">
              <li class="mt-2">
                (1) การให้บริการ ปรับปรุงคุณภาพการให้บริการ การขาย
                การดำเนินกิจกรรมทางการตลาด การศึกษา การวิเคราะห์ข้อมูล
                เพื่อพัฒนาคุณภาพการให้บริการของบริษัทฯ ให้มีประสิทธิภาพยิ่งขึ้น
              </li>
              <li class="mt-2">
                (2) เพื่อประโยชน์ของเจ้าของข้อมูล
                เพื่อเสนอสิทธิประโยชน์ตามความสนใจของเจ้าของข้อมูล
              </li>
              <li class="mt-2">
                (3) เพื่อการจัดซื้อจัดจ้างเพื่อการดำเนินการเกี่ยวกับการบุคลากร
              </li>
              <li class="mt-2">
                (4) เพื่อปฏิบัติตามกฎหมาย
                และหากมีกรณีหากมีการเปลี่ยนแปลงวัตถุประสงค์ใหม่ บริษัทฯ
                จะประกาศให้เจ้าของข้อมูลทราบโดยเร็ว
              </li>
            </ol>
            <p>
              3.2 บริษัทฯ จะทำการเก็บข้อมูลส่วนบุคคล ตัวอย่างเช่น ชื่อ สกุล
              ที่อยู่ วันเดือนปีเกิด เพศ ประวัติการศึกษา หมายเลขโทรศัพท์ อีเมล
              เลขประจำตัวประชาชน ข้อมูลบัตรเครดิตหรือบัตรเดบิต
              เลขที่บัญชีธนาคารหรือข้อมูลอื่นๆ
              ที่เกี่ยวกับการธนาคารหรือการชำระเงิน หมายเลขไอพี หมายเลขบริการ
              Cookies MAC Address บัญชีผู้ใช้บริการ ข้อมูลการใช้บริการ
              บันทึกการติดต่อสื่อสารของเจ้าของข้อมูลกับบริษัทฯ
              และข้อมูลอื่นใดที่อาจเกิดขึ้นในขณะที่ใช้บริการกับบริษัทฯ เป็นต้น
              โดยจะทำการเก็บรักษาข้อมูลส่วนบุคคลตราบเท่าที่จำเป็นเพื่อวัตถุประสงค์ในการประมวลผลข้อมูลและตามกฎหมายที่เกี่ยวข้อง
              เมื่อพ้นระยะเวลาจัดเก็บหรือทางบริษัทฯ
              ไม่มีสิทธิในกาจัดเก็บหรือไม่สามารถอ้างฐานในการประมวลผลข้อมูลส่วนบุคคลของเจ้าของข้อมูลแล้ว
              บริษัทฯ
              จะดำเนินการทำลายข้อมูลส่วนบุคคลนั้นด้วยวิธีการที่เหมาะสมและเป็นไปตามกฎหมายต่อไป
            </p>
            <p>
              3.3 กรณีที่เจ้าของข้อมูลต้องให้ข้อมูลส่วนบุคคล
              เพื่อปฏิบัติตามกฎหมายหรือสัญญาหรือเพื่อเข้าทำสัญญา บริษัทฯ
              จะแจ้งถึงผลกระทบที่เป็นไปได้จากการไม่ให้ข้อมูลส่วนบุคคลให้เจ้าของข้อมูลทราบด้วย
            </p>
            <p>
              3.4 บริษัทฯ
              อาจจะเปิดเผยข้อมูลส่วนบุคคลที่เก็บรวบรวมต่อบุคคลหรือหน่วยงาน เช่น
              การเปิดเผยข้อมูลตามกฎหมาย ความมั่นคง หรือการให้บริการ เป็นต้น
              ทั้งนี้ต้องเป็นการเปิดเผยเท่าที่จำเป็นเท่านั้น
            </p>
            <p>
              3.5 บริษัทฯ จะเก็บรวบรวมข้อมูลส่วนบุคคลของเจ้าของข้อมูลโดยตรง
              เมื่อเจ้าของข้อมูลให้ความยินยอมมาอย่างสมัครใจ หรือโดยชัดแจ้ง
              และโดยวิธีการใดวิธีการหนึ่งดังต่อไปนี้
            </p>
            <ol style="list-style: none">
              <li class="mt-2">
                3.5.1 แบบคำขอใช้บริการ หรือขั้นตอนการยืนคำร้องขอใช้สิทธิต่างๆ
              </li>
              <li class="mt-2">3.5.2 การทำแบบสอบถาม หรือการโต้ตอบทางอีเมล</li>
              <li class="mt-2">
                3.5.3 ทาง Website หรือ Mobile Application ของบริษัทฯ
              </li>
              <li class="mt-2">3.5.4 ทางข้อความสั้น (SMS)</li>
              <li class="mt-2">
                3.5.5 ช่องทางการสื่อสารอื่นๆ ระหว่างเจ้าของข้อมูลกับบริษัทฯ
                ตามแบบวิธีของบริษัทฯ
              </li>
            </ol>
            <p>3.6 บริษัทฯ มีนโยบาย Cookies ตามที่บริษัทฯ กำหนด</p>
            <p>
              3.7 ข้อมูลส่วนบุคคลที่บริษัทฯ
              จัดเก็บบางส่วนอาจเป็นข้อมูลแบบอ่อนไหว (Sensitive Data) ซึ่งบริษัทฯ
              จะแจ้งขอความยินยอมโดยชัดแจ้ง เป็นต้นว่า เชื้อชาติ
              ความเชื่อทางศาสนา ข้อมูลด้านสุขภาพ ประวัติอาชญากรรม
              ข้อมูลสหภาพแรงงาน เป็นต้น และบริษัทฯ
              จะเก็บรวบรวมข้อมูลเหล่านี้เมื่อจำเป็นในการปฏิบัติตามกฎหมายและระเบียบ
              ทั้งนี้ ในการขอความยินยอมนั้น บริษัทฯ
              จะทำการขอความยินยอมจากเจ้าของข้อมูลก่อนหรือในขณะทำการเก็บรวบรวม
              การใช้ การเปิดเผยข้อมูลส่วนบุคคล เว้นแต่ในกรณีดังนี้
            </p>
            <ol style="list-style: none">
              <li class="mt-2">
                3.7.1 เพื่อประโยชน์ที่เกี่ยวกับการศึกษาวิจัยหรือสถิติ
                เพื่อคุ้มครองสิทธิและเสรีภาพของเจ้าของข้อมูล
              </li>
              <li class="mt-2">
                3.7.2 เพื่อป้องกันหรือระงับอันตรายต่อชีวิต ร่างกาย
                หรือสุขภาพของเจ้าของข้อมูลหรือบุคคลอื่น
              </li>
              <li class="mt-2">
                3.7.3 เพื่อปฏิบัติตามสัญญา
                หรือเพื่อใช้ในการดำเนินการตามคำขอของเจ้าของข้อมูลก่อนเข้าทำสัญญานั้น
              </li>
              <li class="mt-2">
                3.7.4
                เพื่อการปฏิบัติหน้าที่ในการดำเนินการภารกิจเพื่อประโยชน์สาธารณะหรือได้รับมอบหมายให้ปฏิบัติหน้าที่ในการใช้อำนาจรัฐ
              </li>
              <li class="mt-2">
                3.7.5 เพื่อประโยชน์โดยชอบด้วยกฎหมายที่ครอบคลุมในกิจการของบริษัทฯ
              </li>
              <li class="mt-2">
                3.7.6 เป็นการปฏิบัติตามคำสั่งศาล หรือที่กฎหมายกำหนด เช่น
                พระราชบัญญัติว่าด้วยการควบคุมโรคติดต่อ
                พระราชบัญญัติว่าด้วยการกระทำผิดเกี่ยวกับคอมพิวเตอร์
                พระราชบัญญัติการรักษาความมั่นคงปลอดภัยไซเบอร์
                พระราชบัญญัติป้องกันและปราบปรามการฟอกเงิน เป็นต้น
              </li>
              <li class="mt-2">
                3.7.7 เป็นข้อมูลที่เปิดเผยต่อสาธารณะโดยชอบด้วยกฎหมายแล้ว
              </li>
            </ol>
            <p>
              3.8
              กรณีที่เจ้าของข้อมูลส่วนบุคคลให้ข้อมูลส่วนบุคคลอื่นที่เกี่ยวข้อง
              เช่น คู่สมรส สมาชิกในครอบครัว หรือเพื่อน เป็นต้น แก่บริษัทฯ
              ตัวอย่างเช่น อาจระบุเป็นที่อยู่ติดต่อฉุกเฉิน
              เจ้าของข้อมูลจะต้องรับรองและรับประกันว่าเจ้าของข้อมูลได้รับความยินยอมให้มีการเก็บรวบรวม
              ใช้ และเปิดเผยข้อมูลส่วนบุคคลดังกล่าวตามที่ระบุไว้ในนโยบายนี้
            </p>
            <p>
              3.9 ในกรณีที่บริษัทฯ ใช้ฐานความยินยอม
              หรือความยินยอมโดยชัดแจ้งเพื่อการเก็บรวบรวม ใช้
              หรือเปิดเผยข้อมูลส่วนบุคคล สำหรับการขอความยินยอมต้องทำโดยชัดแจ้ง
              บริษัทฯ จะจัดทำเป็นหนังสือหรือทำโดยผ่านระบบอิเล็กทรอนิกส์
              เว้นแต่โดยสภาพไม่อาจขอความยินยอมด้วยวิธีการดังกล่าวได้
              และในการขอความยินยอม บริษัทฯ
              จะต้องแจ้งวัตถุประสงค์ของการเก็บรวบรวมใช้
              หรือเปิดเผยข้อมูลส่วนบุคคลไปด้วย
              และการขอความยินยอมต้องแยกส่วนออกจากข้อความอื่นอย่างชัดเจน
              มีแบบหรือข้อความที่เข้าถึงได้ง่ายและเข้าใจได้
              รวมทั้งใช้ภาษาที่อ่านง่าย
              และไม่เป็นการหลอกลวงหรือทำให้เจ้าของข้อมูลส่วนบุคคลเข้าใจผิดในวัตถุประสงค์ดังกล่าว
            </p>
            <p>
              ในการขอความยินยอมจากเจ้าของข้อมูลส่วนบุคคล บริษัทฯ
              จะคำนึงถึงอย่างถึงที่สุดในความเป็นอิสระของเจ้าของข้อมูลส่วนบุคคลในการให้ความยินยอม
              ในการเข้าทำสัญญา ซึ่งรวมถึงการให้บริการใดๆ ของบริษัทฯ
              โดยไม่มีเงื่อนไขในการให้ความยินยอมเพื่อเก็บรวบรวม ใช้ หรือ
              เปิดเผยข้อมูลส่วนบุคคลที่ไม่มีความจำเป็นหรือเกี่ยวข้องสำหรับการเข้าทำสัญญาซึ่งรวมถึงการให้บริการนั้นๆ
              นอกจากนี้
              เจ้าของข้อมูลส่วนบุคคลจะถอนความยินยอมที่ได้ให้ไว้เสียเมื่อใดก็ได้
              โดยจะต้องถอนความยินยอมได้ง่ายเช่นเดียวกับการให้ความยินยอม
              เว้นแต่มีข้อจำกัดสิทธิในการถอนความยินยอมโดยกฎหมายหรือสัญญาที่ให้ประโยชน์แก่เจ้าของข้อมูลส่วนบุคคล
              ทั้งนี้ การถอนความยินยอมย่อมไม่ส่งผลกระทบต่อการเก็บรวบรวม ใช้
              หรือเปิดเผยข้อมูลส่วนบุคคลที่เจ้าของข้อมูลส่วนบุคคลได้ให้ความยินยอมไปแล้วโดยชอบ
              อย่างไรก็ตามในกรณีที่การถอนความยินยอมส่งผลกระทบต่อเจ้าของข้อมูลส่วนบุคคลในเรื่องใด
              บริษัทฯ
              จะแจ้งให้เจ้าของข้อมูลส่วนบุคคลทราบถึงผลกระทบจากการถอนความยินยอมนั้น
            </p>
            <p>
              ในการขอความยินยอมเพื่อเก็บรวบรวม ใช้
              หรือเปิดเผยข้อมูลส่วนบุคคลของผู้เยาว์ซึ่งยัง
              ไม่บรรลุนิติภาวะโดยการสมรส
              หรือไม่มีฐานะเสมือนดังบุคคลซึ่งบรรลุนิติภาวะแล้วตามมาตรา 27
              แห่งประมวลกฎหมายแพ่งและพาณิชย์
              รวมทั้งข้อมูลส่วนบุคคลของผู้ไร้ความสามารถหรือคนเสมือนไร้ความสามารถ
              หรือการถอนความยินยอมของบุคคลดังกล่าว บริษัทฯ
              จะดำเนินการให้เป็นไปตามที่กฎหมายว่าด้วยการคุ้มครองข้อมูลส่วนบุคคลบัญญัติไว้
            </p>
            <p class="text-darkgreen-2">
              <strong>4. การใช้หรือการเปิดเผยข้อมูลส่วนบุคคล</strong>
            </p>
            <p>
              การใช้หรือการเปิดเผยข้อมูลส่วนบุคคลให้เป็นไปตามวัตถุประสงค์หรือเป็นการจำเป็นเพื่อประโยชน์ที่มีความเกี่ยวข้องโดยตรงกับวัตถุประสงค์ของการเก็บรวบรวม
              ทั้งนี้ บุคคล หน่วยงาน ที่บริษัทฯ
              อาจเปิดเผยข้อมูลส่วนบุคคลของเจ้าของข้อมูล
              โดยจำเป็นต้องส่งข้อมูลส่วนบุคคลของเจ้าของข้อมูลไปยังบุคคลหรือหน่วยงานภายนอกใดๆ
              เช่น กรมสวัสดิการและคุ้มครองแรงงาน
              กรมบังคับคดีหรือสำนักงานบังคับคดี กองทุนเงินให้กู้ยืมเพื่อการศึกษา
              กองบังคับการปราบปรามการกระทำความผิดเกี่ยวกับอาชญากรรมทางเทคโนโลยี
              หรือหน่วยงานด้านความมั่นคง เป็นต้น
              ทั้งนี้ให้ดำเนินการเพื่อปฏิบัติตามกฎหมายเท่าที่จำเป็นเท่านั้น
            </p>
            <p class="text-darkgreen-2">
              <strong>5. วัตถุประสงค์ของการประมวลผลข้อมูลส่วนบุคคล</strong>
            </p>
            <p>
              บริษัทฯ ทำการประมวลผลข้อมูลส่วนบุคคล
              โดยมีวัตถุประสงค์และอ้างฐานทางกฎหมาย ดังนี้
            </p>
            <p>5.1. ประมวลข้อมูลตามฐานสัญญา (Contract) ตัวอย่างเช่น</p>
            <ol style="list-style: none">
              <li class="mt-2">
                5.1.1 เมื่อลูกค้า คู่สัญญา และผู้ใช้บริการ
                ติดต่อเกี่ยวกับข้อเสนอการให้บริการหรือเข้าทำสัญญากับบริษัท
                จำเป็นที่ ลูกค้า คู่สัญญา และผู้ใช้บริการ
                ต้องให้ข้อมูลส่วนบุคคลแก่บริษัท
                เพื่อบริษัทจะได้นำข้อมูลดังกล่าวไปประมวลผลเกี่ยวกับ
                การให้บริการหรือการเข้าทำสัญญา หรือเพื่อติดต่อสื่อสารกับลูกค้า
                คู่สัญญา และผู้ใช้บริการ
                หรือเพื่อติดตามและแจ้งผลเกี่ยวกับการปฏิบัติตามสัญญา
              </li>
              <li class="mt-2">
                5.1.2
                เมื่อบุคลากรทำการสมัครเข้าทำงานกับบริษัทหรือทำธุรกรรมที่เกี่ยวข้องกับบริษัทผ่านทางช่องทางต่าง
                ๆ
                บุคลากรจำเป็นต้องให้ข้อมูลส่วนบุคคลแก่บริษัทเพื่อที่บริษัทจะได้นำข้อมูลดังกล่าวไปประมวลผลเกี่ยวกับการพิจารณา
                คัดเลือกและอนุมัติการจ้างงาน
                รวมถึงการานำไปใช้เพื่อคำนวณและให้สิทธิอันเกิดจากการทำงาน
                กำหนดและเบิกจ่าย เงินเดือน
                ติดต่อสื่อสารกับบุคลากรติดตามและแจ้งผลประโยชน์ที่บุคลากรได้รับแจ้งการเปลี่ยนแปลงเกี่ยวกับ
                ผลประโยชน์หรือสิทธิอันเกี่ยวข้องกับการทำงานและปฏิบัติหน้าที่
                ตอบข้อซักถาม และแจ้งการเปลี่ยนแปลงต่างๆ
              </li>
            </ol>
            <p>
              5.2. ประมวลผลข้อมูลตามฐานความยินยอม (Consent) ตัวอย่างเช่น <br />
              บริษัทฯ อาจนำข้อมูลส่วนบุคคลของลูกค้า คู่สัญญา
              และผู้ใช้บริการไปใช้ในการประมวลผลเพื่อการเข้าทำสัญญากับบุคคลดังกล่าวบริษัทอาจมีความจำเป็นในการประมวลผลข้อมูลอ่อนไหวตามที่ปรากฏในเอกสารแสดงตัวตน
              (เช่น ศาสนา)
              เพื่อวัตถุประสงค์ในการพิสูจน์และยืนยันตัวตนของบุคคลดังกล่าว
              และอาจนำข้อมูลอ่อนไหวของบุคลากรไปใช้ในการประมวลผลเพื่อประกอบการช่วยเหลือบุคลากรในกรณีที่
              บุคลากรเจ็บป่วยหรือต้องการความช่วยเหลืออย่างเร็งด่วนรวมถึงการอำนวยความสะดวกแก่บุคลากรเกี่ยวกับประกันชีวิต
              และการเบิกจ่ายค่ารักษาพยาบาล ทั้งนี้ บริษัทฯ
              จะไม่ทำการประมวลผลข้อมูลส่วนบุคคลดังกล่าวโดยไม่ได้รับความยินยอมจากลูกค้า
              คู่สัญญา ผู้ใช้บริการ และบุคลากรก่อน
            </p>
            <p>
              อนึ่ง หากลูกค้า คู่สัญญา ผู้ใช้บริการ
              และบุคลากรประสงค์จะถอนความยินยอมในการประมวลผลข้อมูลส่วนบุคคลในกรณีข้างต้นนี้
              ลูกค้า คู่สัญญา ผู้ใช้บริการ และบุคลากรสามารถติดต่อกับบริษัทฯ
              เพื่อขอถอนความยินยอมได้
            </p>
            <p>
              5.3.
              ประมวลผลข้อมูลประมวลผลข้อมูลตามฐานประโยชน์โดยชอบด้วยกฎหมายของผู้ควบคุมข้อมูลส่วนบุคคล
              (Legitimate Interest) ตัวอย่างเช่น บริษัทฯ
              นำข้อมูลส่วนบุคคลของลูกค้า คู่สัญญา และผู้ใช้บริการไปประมวลผล
              เพื่อการบริหารการดำเนินธุรกิจ และการจัดการความสัมพันธ์ตามข้อตกลง
              ซึ่งรวมถึง
              แต่ไม่จำกัดเพียงการดำเนินการและการออกใบแจ้งหนี้การปฏิบัติ
              ตามข้อกำหนดว่าด้วยการเก็บรักษาบันทึกภายในการจัดการภายใน
              การสอบบัญชี การรายงาน การส่งหรือยื่นข้อมูล การประมวลผลข้อมูล
              หรือกิจกรรมอื่นที่เกี่ยวข้อง หรือคล้ายกัน ทั้งนี้ บริษัทฯ
              อาจนำข้อมูลส่วนบุคคลของบุคลากรไปประมวลผลเพื่อการจัดการและการจัดทำรายงานภายในของบริษัทฯ
              การดูแลรักษาระบบเพื่อการรักษามาตรฐานการปฏิบัติงานและให้บริการ
              รวมถึงการดำเนินการด้านภาษีและการจัดการความเสี่ยงของบริษัทฯ
              การสอบบัญชี การส่งหรือยื่นข้อมูล การประมวลผลข้อมูล
              หรือกิจกรรมอื่นที่เกี่ยวข้องหรือคล้ายกัน
            </p>
            <p>
              5.4. ประมวลผลข้อมูลตามฐานการปฏิบัติตามกฎหมาย (Legal Obligation)
              โดยบริษัทฯ อาจนำข้อมูลส่วนบุคคลของลูกค้า คู่สัญญา
              และผู้ใช้บริการไปประมวลผลเพื่อการปฏิบัติตามกฎหมายที่ใช้บังคับ
              ทั้งนี้ รวมถึงการปฏิบัติตามคำสั่งของผู้มีอำนาจตามกฎหมาย
              ตามภาระผูกพันที่กฎหมายกำหนด
              สิทธิและหน้าที่ภายใต้กฎหมายที่บริษัทใช้บังคับและ/หรือกระบวนการภายใน
              การตรวจจับการทุจริต การตรวจสอบทางกฎหมายหรือกฎข้อบังคับอื่นๆ
              และบริษัทฯ
              อาจนำข้อมูลส่วนบุคคลของบุคลากรไปประมวลผลเพื่อการปฏิบัติตามกฎหมายที่เกี่ยวกับการจ้างงาน
              และการประกอบธุรกิจของบริษัท เช่น พระราชบัญญัติคุ้มครองแรงงาน พ.ศ.
              2562 พระราชบัญญัติกองทุนเงินให้กู้ยืมเพื่อการศึกษา พ.ศ. 2560
              พระราชบัญญัติกองทุนสำรองเลี้ยงชีพ พ.ศ. 2530 เป็นต้น
              รวมทั้งกฎหมายอื่นที่บริษัทต้องอยู่ภายใต้บังคับที่กำหนดให้ส่งข้อมูล
            </p>
            <p class="text-darkgreen-2">
              <strong>6. การรักษาความมั่นคงปลอดภัยของข้อมูลส่วนบุคคล</strong>
            </p>
            <p>
              บริษัทฯ จะดำเนินการดูแลและเก็บข้อมูลส่วนบุคคลให้มีความเหมาะสม
              ไม่ว่าจะข้อมูลส่วนบุคคลของท่านจะอยู่ในแบบเอกสาร ไฟล์
              หรือระบบอิเล็กทรอนิกส์ รวมทั้งเครื่องมือต่างๆ ที่บริษัทฯ ใช้
              เพื่อรักษาความมั่นคงปลอดภัยของข้อมูลส่วนบุคคลของท่าน
              โดยให้เป็นไปตามกฎหมาย ทั้งนี้ เพื่อประโยชน์ในการรักษาความลับ
              ความถูกต้องครบถ้วน และความพร้อมใช้งานของข้อมูลส่วนบุคคล
              เป็นการป้องกันการสูญหาย การเข้าถึง การใช้ เปลี่ยนแปลง
              แก้ไขหรือเปิดเผยข้อมูลส่วนบุคคลโดยมิชอบ
              หรือกระทำการโดยปราศจากอำนาจโดยชอบด้วยกฎหมาย โดยบริษัทฯ
              ได้กำหนดและดำเนินมาตรการรักษาความมั่นคงปลอดภัยของข้อมูลส่วนบุคคลตามแนวทางดังต่อไปนี้
            </p>
            <p>
              6.1 จัดให้มีมาตรการการยืนยันตัวตน (Authentication) กำหนดสิทธิ
              (Authorization) และการบันทึกกิจกรรม (Accounting) ในการเข้าถึง
              การใช้ การเปิดเผย
              การประมวลผลข้อมูลส่วนบุคคลตามมาตรการรักษาความมั่นคงปลอดภัยด้านสารสนเทศของบริษัทฯ
              อย่างเคร่งครัด
            </p>
            <p>
              6.2 ในกรณีที่บริษัทฯ ส่งหรือโอนข้อมูลส่วนบุคคลไปยังต่างประเทศ
              รวมถึงการนำข้อมูลส่วนบุคคลไปเก็บบนฐานข้อมูลในระบบอื่นใด
              ซึ่งผุ้ให้บริการรับโอนข้อมูลหรือบริการเก็บข้อมูลอยู่ต่างประเทศนั้น
              ต้องมีมาตรการคุ้มครองข้อมูลส่วนบุคคลที่เพียงพอหรือเทียบเท่ามาตรการตามนโยบายนี้
              เว้นแต่การนั้นจะเป็นไปตามกฎหมายหรือได้รับความยินยอมจากเจ้าของข้อมูล
            </p>
            <p>
              6.3 ในกรณีที่มีการฝ่าฝืนมาตรการการรักษาความมั่นคงปลอดภัยของบริษัทฯ
              จนเป็นเหตุให้มีการละเมิดข้อมูลส่วนบุคคลหรือข้อมูลส่วนบุคคลรั่วไหลสู่สาธารณะ
              บริษัทฯ จะดำเนินการแจ้งเจ้าของข้อมูลให้ทราบโดยเร็ว
              รวมทั้งแจ้งแผนการเยียวยาความเสียหายจากการละเมิดหรือรั่วไหลของข้อมูลส่วนบุคคลสู่ธารณะในกรณีที่เกิดจากความบกพร่องของบริษัทฯ
              ที่ส่งผลต่อสิทธิและเสรีภาพของเจ้าของข้อมูลส่วนบุคคล
              ทั้งนี้บริษัทจะไม่รับผิดชอบในกรณีความเสียหายใดๆ
              อันเกิดจากการใช้หรือการเปิดเผยข้อมูลส่วนบุคคลต่อบุคคลที่สามรวมถึงการละเลยหรือเพิกเฉยการออกจากระบบ
              (Log out) ที่เจ้าของข้อมูลได้เข้าไปใช้งาน
              โดยการกระทำของเจ้าของข้อมูลหรือบุคคลอื่นซึ่งได้รับความยินยอมจากเจ้าของข้อมูล
            </p>
            <p>
              6.4 บริษัทฯ
              กำหนดระเบียบให้บุคลากรทุกคนถือปฏิบัติในการเข้าถึงข้อมูลส่วนบุคคลของลูกค้า
              คู่สัญญา ผู้ใช้บริการ และบุคลากร
              โดยบุคลากรที่สามารถเข้าถึงข้อมูลส่วนบุคคลเหล่านั้นได้จะเป็นเพียงบุคลากรที่มีความจำเป็นต้องรับทราบ
              ข้อมูลเพื่อการปฏิบัติหน้าที่ของตนเท่านั้น เช่น
              บุคลากรที่มีหน้าที่ด้านทรัพยากรบุคคล
              บุคลากรที่ดูแลและบริหารสัญญาระหว่างบริษัทกับคู่สัญญา เป็นต้น
            </p>
            <p>
              6.5 บริษัทฯ
              มีการดำเนินการสอบทานและประเมินประสิทธิภาพของระบบคอมพิวเตอร์เพื่อทำการรักษาความมั่นคงปลอดภัยของข้อมูลส่วนบุคคลตามมาตรการที่กำหนดไว้ให้มีประสิทธิภาพอยู่เสมอ
            </p>
            <p class="text-darkgreen-2">
              <strong>7. บทบาทหน้าที่และความรับผิดชอบ</strong>
            </p>
            <p>
              บริษัทฯ
              กำหนดให้บุคลากรหรือหน่วยงานที่เกี่ยวข้องกับข้อมูลส่วนบุคคลต้องให้ความสำคัญและรับผิดชอบในการเก็บรวบรวม
              ใช้
              หรือเปิดเผยข้อมูลส่วนบุคคลตามนโยบายและแนวปฏิบัติในการคุ้มครองข้อมูลส่วนบุคคลของบริษัทฯ
              อย่างเคร่งครัด โดยกำหนดให้บุคคลหรือหน่วยงานดังต่อไปนี้
              ทำหน้าที่กำกับและตรวจสอบให้การดำเนินงานของบริษัทนั้นถูกต้องและเป็นไปตามนโยบายและกฎหมายว่าด้วยการคุ้มครองข้อมูลส่วนบุคคลกำหนด
            </p>
            <p>
              7.1 <strong>คณะกรรมการบริษัท</strong> มีหน้าที่รับผิดชอบ ได้แก่
            </p>
            <ol style="list-style: none">
              <li class="mt-2">
                7.1.1
                กำหนดให้มีนโยบายและแนวปฏิบัติการคุ้มครองข้อมูลบุคคลและความเป็นส่วนตัว
              </li>
              <li class="mt-2">
                7.1.2 กำกับดูแลให้มีการนำนโยบายไปปฏิบัติอย่างเป็นรูปธรรม
              </li>
            </ol>
            <p>
              7.2 <strong>ผู้บริหารทุกระดับ</strong> มีหน้าที่รับผิดชอบ ได้แก่
            </p>
            <ol style="list-style: none">
              <li class="mt-2">
                7.2.1
                จัดให้มีระเบียบปฏิบัติและมาตรการในการจัดเก็บข้อมูลส่วนบุคคลให้เหมาะสมกับบริบทของแต่ละบริษัทฯ
                โดยให้สอดคล้องกับนโยบาย แนวปฏิบัติ กฎหมาย และมาตรฐานสากล
              </li>
              <li class="mt-2">
                7.2.2 จัดให้มีผู้รับผิดชอบ เช่น
                หน่วยงานหรือบุคลากรที่รับผิดชอบเพื่อดูแลการดำเนินงานให้เป็นไปตามระเบียบปฏิบัติ
              </li>
              <li class="mt-2">
                7.2.3 ในกรณีที่บริษัทฯ ว่าจ้างบุคคลธรรมดาหรือนิติบุคคลจากภายนอก
                เพื่อให้ดำเนินการเกี่ยวกับข้อมูลส่วน
                บุคคลต้องมีระบบการคัดเลือกที่มีการวางระบบการคุ้มครองข้อมูลที่ได้มาตรฐาน
              </li>
              <li class="mt-2">
                7.2.4 กำกับดูแลให้มีการปฏิบัติตามนโยบายและแนวปฏิบัติ
                และระเบียบปฏิบัติ ตลอดจนหาแนวทางพัฒนา
                ปรับปรุงเพื่อให้การนำไปปฏิบัติมีประสิทธิภาพมากขึ้นรวมทั้งมั่นใจว่ามีการรายงานผลการปฏิบัติงาน
                ตามนโยบายและแนวปฏิบัติและระเบียบปฏิบัติ
              </li>
            </ol>
            <p>
              7.3
              <strong
                >หน่วยงานหรือบุคคลที่ได้รับมอบหมายให้เป็นผู้เก็บรวบรวม</strong
              >
              ใช้หรือเปิดเผยข้อมูลส่วนบุคคล มีหน้าที่รับผิดชอบได้แก่
            </p>
            <ol style="list-style: none">
              <li class="mt-2">
                7.3.1
                ดำเนินการและควบคุมการดำเนินการเกี่ยวกับการประมวลข้อมูลทั้งการแจ้ง
                ขอความยินยอม เก็บรวม รวม ใช้
                หรือเปิดเผยข้อมูลส่วนบุคคลให้เป็นไปตามระเบียบปฏิบัติการคุ้มครองข้อมูลส่วนบุคคลและกฎหมายที่กำหนด
              </li>
              <li class="mt-2">
                7.3.2
                ดำเนินการและควบคุมการดำเนินมาตรการรักษาความมั่นคงปลอดภัยที่เหมาะสม
                เพื่อป้องกันการสูญหาย เข้าถึง ใช้ เปลี่ยนแปลง แก้ไข
                หรือเปิดเผยข้อมูลส่วนบุคคลโดยปราศจากอำนาจหรือโดยมิชอบ
                ตามที่กำหนดไว้ในระเบียบปฏิบัติการคุ้มครองข้อมูลส่วนบุคคลรวมทั้งแจ้งให้ผู้ควบคุมข้อมูลส่วน
                บุคคลทราบถึงเหตุการละเมิดข้อมูลส่วนบุคคลที่เกิดขึ้น
              </li>
              <li class="mt-2">
                7.3.3
                ดำเนินการและควบคุมการลบหรือทำลายข้อมูลเมื่อพ้นกำหนดระยะเวลาการเก็บรักษา
                หรือที่ไม่
                เกี่ยวข้องหรือเกินความจำเป็นตามวัตถุประสงค์ในการเก็บรวบรวม
                หรือตามที่เจ้าของข้อมูลส่วนบุคคลได้ร้องขอ
              </li>
              <li class="mt-2">
                7.3.4 ตรวจสอบและควบคุม ปรับปรุงข้อมูลส่วนบุคคลให้มีความถูกต้อง
                ทันสมัยและเป็นปัจจุบัน
              </li>
              <li class="mt-2">
                7.3.5
                เมื่อพบการรั่วไหลหรือการละเมิดข้อมูลส่วนบุคคลต้องแจ้งคณะทำงานเพื่อคุ้มครองข้อมูลส่วนบุคคล
                ทราบทันที
              </li>
              <li class="mt-2">
                7.3.6
                ดำเนินการควบคุมการบันทึกข้อมูลและรายงานที่เกี่ยวข้องกับข้อมูลส่วนบุคคลที่รับผิดชอบ
              </li>
              <li class="mt-2">
                7.3.7
                ประเมินความเสี่ยงที่เกี่ยวข้องกับข้อมูลส่วนบุคคลที่ตนรับผิดชอบ
                บริหารจัดการและดำเนินตามมาตรการที่กำหนดเพื่อลดความเสี่ยง
              </li>
            </ol>
            <p>7.4 <strong>คณะทำงาน PDPA</strong> มีหน้าที่รับผิดชอบได้แก่</p>
            <ol style="list-style: none">
              <li class="mt-2">
                7.4.1
                ให้คำแนะนำแก่ผู้ควบคุมข้อมูลส่วนบุคคลหรือผู้ประมวลผลข้อมูลส่วนบุคคลรวมทั้งพนักงานที่เกี่ยวข้องกับการปฏิบัติตามพระราชบัญญัติคุ้มครองข้อมูลส่วนบุคคล
              </li>
              <li class="mt-2">
                7.4.2
                ตรวจสอบการดำเนินงานของผู้ควบคุ้มข้อมูลส่วนบุคคลหรือผู้ประมวลผลข้อมูลส่วนบุคคลเกี่ยวกับการ
                เก็บรวบรวม ใช้
                หรือเปิดเผยข้อมูลส่วนบุคคลเพื่อให้เป็นไปตามที่กฎหมายกำหนด
              </li>
              <li class="mt-2">
                7.4.3
                ประสานงานและให้ความร่วมมือกับสำนักงานคณะกรรมการคุ้มครองข้อมูลส่วนบุคคลในกรณีที่มีปัญหาเกี่ยวกับการเก็บรวบรวม
                ใช้
                หรือเปิดเผยข้อมูลส่วนบุคคลของผู้ควบคุมข้อมูลส่วนบุคคลหรือผู้ประมวลผลข้อมูลส่วนบุคคล
              </li>
              <li class="mt-2">
                7.4.4
                รักษาความลับของข้อมูลส่วนบุคคลที่ตนล่วงรู้หรือได้มาเนื่องจากการปฏิบัติหน้าที่
              </li>
            </ol>
            <p>
              7.5
              <strong
                >เจ้าหน้าที่คุ้มครองข้อมูลส่วนบุคคล (Data Protection Officer) </strong
              >มีหน้าที่รับผิดชอบได้แก่
            </p>
            <ol style="list-style: none">
              <li class="mt-2">
                7.5.1 ให้คำแนะนำในด้านต่างๆ
                ที่เกี่ยวกับการคุ้มครองข้อมูลส่วนบุคคลแก่ผู้บริหาร
                บุคลากรและคู่ค้าของบริษัทฯ
              </li>
              <li class="mt-2">
                7.5.2
                ตรวจตราการดำเนินงานของผู้ควบคุมข้อมูลส่วนบุคคลและผู้ประมวลผลข้อมูลส่วนบุคคล
              </li>
              <li class="mt-2">
                7.5.3
                ประสานงานและให้ความร่วมมือกับสำนักงานคณะกรรมการคุ้มครองข้อมูลส่วนบุคคล
                ในกรณีที่มีปัญหาเกี่ยวกับการเก็บรวบรวม ใช้
                หรือเปิดเผยข้อมูลส่วนบุคคลของบริษัทฯ ลูกค้า คู่ค้าของบริษัทฯ
                หรือบุคคลอื่นใดที่เกี่ยวข้อง
              </li>
            </ol>
            <p class="text-darkgreen-2">
              <strong>8. สิทธิของเจ้าของข้อมูลส่วนบุคคล </strong>
            </p>
            <p>
              บริษัทฯ
              จัดให้มีช่องทางและอำนวยความสะดวกให้แก่เจ้าของข้อมูลส่วนบุคคลหรือผู้มีอำนาจกระทำการแทนในการใช้สิทธิของเจ้าของข้อมูลส่วนบุคคลตามกฎหมายว่าด้วยการคุ้มครองข้อมูลส่วนบุคคล
              ซึ่งเปิดให้เจ้าของข้อมูลส่วนบุคคลดำเนินการตามสิทธิอันกฎหมายรับรองและคุ้มครองให้ดังต่อไปนี้
            </p>
            <p>
              8.1
              สิทธิขอเข้าถึงและขอรับสำเนาข้อมูลส่วนบุคคลที่เกี่ยวกับตนซึ่งอยู่ในความรับผิดชอบของบริษัทฯ
              หรือขอให้เปิดเผยถึงการได้มาซึ่งข้อมูลส่วนบุคคลที่ตนไม่ได้ให้ความยินยอม
              (Right of Access)
            </p>
            <p>
              8.2 สิทธิขอรับข้อมูลส่วนบุคคลที่เกี่ยวกับตนจากบริษัทฯ
              ในกรณีที่บริษัทฯ
              ได้ทำให้ข้อมูลส่วนบุคคลนั้นอยู่ในรูปแบบที่สามาถอ่านหรือใช้งานโดยทั่วไปได้ด้วยเครื่องมือหรืออุปกรณ์ที่ทำงานได้โดยอัตโนมัติและสามารถใช้
              หรือเปิดเผยข้อมูลส่วนบุคคลได้ด้วยวิธีการอัตโนมัติ
              รวมถึงสิทธิขอให้บริษัทฯ
              ส่งต่อหรือโอนข้อมูลส่วนบุคคลในรูปแบบดังกล่าวไปยังผู้ควบคุมข้อมูลส่วนบุคคลอื่นเมื่อสามารถทำได้ด้วยวิธีการอัตโนมัติและสิทธิขอรับข้อมูลส่วนบุคคลที่บริษัทฯ
              ส่งหรือโอนข้อมูลส่วนบุคคลในรูปแบบดังกล่าวไปยังผู้ควบคุมข้อมูลส่วนบุคคลอื่นโดยตรง
              เว้นแต่โดยสภาพทางเทคนิคไม่สามารถทำได้ (Right to Date Portability)
            </p>
            <p>
              8.3 สิทธิคัดค้านการเก็บรวบรวม ใช้
              หรือเปิดเผยข้อมูลส่วนบุคคลที่เกี่ยวกับตน (Right to Object)
            </p>
            <p>
              8.4 สิทธิขอให้บริษัทฯ ดำเนินการลบหรือทำลาย
              หรือทำให้ข้อมูลส่วนบุคคลเป็นข้อมูลที่ไม่สามารถระบุตัวบุคคลที่เป็นเจ้าของข้อมูลส่วนบุคคลได้
              (Right to Erasure)
            </p>
            <p>
              8.5 สิทธิขอให้บริษัทฯ ระงับการใช้ข้อมูลส่วนบุคคล (Right to
              Restriction of Processing)
            </p>
            <p>
              8.6 สิทธิร้องขอให้บริษัทฯ ดำเนินการให้ข้อมูลส่วนบุคคลถูกต้อง
              เป็นปัจจุบัน สมบูรณ์และไม่ก่อให้เกิดความเข้าใจผิด (Right to
              Rectification)
            </p>
            <p>
              ทั้งนี้ ตามที่กฎหมายบัญญัติ และบริษัทฯ
              อาจปฏิเสธการใช้สิทธิดังกล่าวข้างต้นของเจ้าของข้อมูลส่วนบุคคลหรือผู้มีอำนาจกระทำการแทนได้หากไม่ขัดต่อกฎหมาย
            </p>
            <p class="text-darkgreen-2">
              <strong>9. นโยบายการใช้คุกกี้ (Cookies) </strong>
            </p>
            <p>
              เมื่อท่านเยี่ยมชมเว็บไซต์ของบริษัทฯ
              เราอาจจะเก็บรวบรวมข้อมูลบางประการโดยอัตโนมัติจากท่านผ่านการใช้คุกกี้
              โดยคุกกี้ (Cookies) คือ
              ไฟล์ขนาดเล็กซึ่งอาจถูกติดตั้งและ/หรือจัดเก็บในอุปกรณ์ของท่าน
              ได้แก่ คอมพิวเตอร์ โทรศัพท์มือถือ แท็บเล็ต เป็นต้น
              เมื่อท่านเยี่ยมชมเว็บไซต์หนึ่งๆ
              และคุกกี้นั้นจะถูกส่งกลับไปยังเว็บไซต์ต้นทางในแต่ละครั้งของการเข้าเยี่ยมชมในครั้งต่อๆ
              มา หรือไปยังเว็บไซต์อื่นๆ ที่จดจำคุกกี้นั้นๆ ได้
              หรือกล่าวได้ว่าคุกกี้ ก็คือ
              ข้อมูลที่เฉพาะเจาะจงกับคอมพิวเตอร์ของท่าน
              เมื่อท่านเยี่ยมชมเว็บไซต์
              คุกกี้จะทำหน้าที่ในการจัดเก็บหรือติดตามข้อมูลเกี่ยวกับการใช้เว็บไซต์ของท่านและนำมาใช้ในการวิเคราะห์กระแสความนิยม
              (Trend) การบริหารจัดการเว็บไซต์
              ติดตามการเคลื่อนไหวการใช้เว็บไซต์ของผู้ใช้บริการ
              หรือเพื่อจดจำการตั้งค่าของผู้ใช้บริการ คุกกี้บางประเภทนั้น
              มีความจำเป็น (Necessary Cookie)
              เนื่องจากหากปราศจากคุกกี้ที่จำเป็นประเภทนี้แล้ว
              หน้าเว็บไซต์อาจจะไม่สามารถใช้การได้อย่างเหมาะสม
              และคุกกี้ประเภทอื่นๆ
              จะทำให้บริษัทสามารถปรับปรุงประสบการณ์การเข้าใช้เว็บไซต์ของท่าน
              ปรับแต่งเนื้อหาตามความต้องการของท่านและทำให้การท่องเว็บไซต์สะดวกมากขึ้น
              เนื่องจากคุกกี้จะจดจำชื่อผู้ใช้ (ในวิธีการที่ปลอดภัย)
              รวมทั้งจดจำการตั้งค่าทางภาษาของท่าน
            </p>
            <p>
              อย่างไรก็ตาม โดยปกติอินเตอร์เน็ตเบราว์เซอร์ (Internet Browser)
              ส่วนใหญ่จะให้ท่านตั้งค่าว่า ท่านจะยอมรับคุกกี้หรือไม่
              หากท่านเลือกไม่ยอมรับให้มีการติดตามโดยคุกกี้ หรือให้ลบคุกกี้ออกไป
              ทางเลือกของท่านอาจมีผลต่อการใช้งานเว็บไซต์ของท่าน
              และหากไม่มีการเก็บคุกกี้
              การใช้งานฟังก์ชันหรือเว็บไซต์บางส่วนอาจถูกจำกัด
            </p>
            <p>
              นอกจากนี้ บุคคลภายนอก อาจใช้คุกกี้ผ่านเว็บไซต์ของบริษัทฯ
              เพื่อนำเสนอโฆษณาที่เกี่ยวข้องกับความสนใจของท่าน
              ตามประวัติกิจกรรมการของเข้าชมเว็บไซต์ของท่าน
              บุคคลภายนอกเหล่านี้อาจเก็บรวบรวมประวัติของท่านหรือข้อมูลอื่นเพื่อให้ทราบว่าท่านเข้าถึงเว็บไซต์อย่างไร
              และเว็บเพจที่ท่านเข้าไปเยี่ยมชมหลังจากที่ออกจากเว็บไซต์ของบริษัทฯ
              ข้อมูลที่รวบรวมผ่านระบบอัตโนมัติเหล่านี้อาจมีความเกี่ยวข้องกับข้อมูลส่วนบุคคลที่ท่านได้ให้ไว้ก่อนหน้านี้บนเว็บไซต์ของบริษัทฯ
              ทั้งนี้ท่านเองก็อาจตกอยู่ภายใต้นโยบายความเป็นส่วนตัวหรือนโยบายการใช้คุกกี้ของบุคคลภายนอกเหล่านั้นได้เช่นกัน
              บริษัทฯ จึงขอแนะนำให้ท่านอ่านนโยบายความเป็นส่วนตัว
              หรือนโยบายการใช้คุกกี้ของบุคคลภายนอกดังกล่าว
              เพื่อศึกษาข้อมูลเพิ่มเติมเกี่ยวกับวิธีการที่บุคคลภายนอกดังกล่าวเก็บรวบรวม
              ใช้ หรือเปิดเผยข้อมูลส่วนบุคคลของท่านด้วย
            </p>
            <p class="text-darkgreen-2">
              <strong
                >10. การปรับปรุง ทบทวน หรือแก้ไข นโยบายความเป็นส่วนตัว
              </strong>
            </p>
            <p>
              บริษัทฯ อาจดำเนินการปรับปรุง ทบทวน หรือแก้ไข
              นโยบายฉบับนี้ได้ไม่ว่าบางส่วนหรือทั้งหมด
              หรือเป็นครั้งคราวเพื่อให้สอดคล้องกับแนวทางการดำเนินงานของบริษัทฯ
              และสอดคล้องกับกฎหมาย
              ประกาศหรือคำสั่งของหน่วยงานราชการที่กำหนดให้ดำเนินการ
            </p>
            <p class="text-darkgreen-2">
              <strong>11. การใช้บังคับนโยบายความเป็นส่วนตัว </strong>
            </p>
            <p>
              นโยบายความเป็นส่วนตัวนี้
              มีผลใช้บังคับกับข้อมูลส่วนบุคคลทั้งหมดที่บริษัทฯ เป็นผู้เก็บรวบรวม
              ใช้และเปิดเผยและเจ้าของข้อมูลตกลงให้บริษัทฯ มีสิทธิในการเก็บรวบรวม
              และนำข้อมูลส่วนบุคคลของเจ้าของข้อมูลที่บริษัทฯ
              ได้เก็บรวบรวมไว้แล้ว (หากมี) ตลอดจนข้อมูลส่วนบุคคลที่บริษัทฯ
              เก็บรวบรวมในปัจจุบันและที่จะเก็บรวบรวมในอนาคต ไปใช้
              หรือเปิดเผยแก่บุคคลอื่นภายในขอบเขตที่ระบุไว้ในนโยบายความเป็นส่วนตัวนี้
            </p>
            <p class="text-darkgreen-2">
              <strong>12. การจ้างผู้ประมวลผลข้อมูลส่วนบุคคล </strong>
            </p>
            <p>
              บริษัทฯ
              ได้กำหนดแนวทางปฏิบัติในการทำสัญญาจ้างประมวลผลข้อมูลส่วนบุคคลกับบุคคลหรือนิติบุคคลภายนอกที่เป็นผู้ประมวลผลข้อมูลส่วนบุคคลไว้ดังนี้
            </p>
            <p>
              12.1 ก่อนทำการจ้างผู้ประมวลผลข้อมูล บริษัทฯ
              ต้องประเมินระบบและแนวทางการคุ้มครองข้อมูลส่วนบุคคลของผู้รับจ้างก่อน
              หากผู้รับจ้างประมวลผลไม่มีระบบการป้องกันหรือไม่เพียงพอการทำสัญญาจ้างผู้ประมวลผลต้องให้ผู้ประมวลผลปฏิบัติตามระเบียบปฏิบัติหรือประกาศที่บริษัทฯ
              กำหนด
            </p>
            <p>
              12.2 ในสัญญาจ้างต้องระบุวัตถุประสงค์ วิธีการเก็บข้อมูล
              การแจ้งเจ้าของข้อมูล การใช้ การส่ง การโอน ข้อมูล
              และการกำจัดหรือลบทิ้งทำลายข้อมูล
            </p>
            <p>
              12.3 คู่สัญญาต้องลงนามในข้อตกลงการประมวลผลข้อมูลส่วนบุคคล (Data
              Processing Agreement - DPA) ให้เป็นไปตามที่กฎหมาย
              หรือที่ระเบียบของบริษัทฯ ได้กำหนดไว้
            </p>
            <p>
              12.4 เมื่อมีการจ้างผู้ประมวลผลข้อมูลส่วนบุคคล
              ต้องทำการควบคุมการประมวลผลตามที่จ้างและการควบคุมการปฏิบัติให้
              เป็นไปตามแนวปฏิบัติที่เกี่ยวข้องได้กำหนดไว้
            </p>
            <p>
              12.5 เมื่อครบกำหนดการเก็บรักษาข้อมูล
              ต้องติดตามและควบคุมให้ผู้รับจ้างประมวลผลข้อมูลส่วนบุคคลนั้น
              ทำการลบทิ้งทำลายหรือทำให้ข้อมูลนั้นเป็นข้อมูลนิรนาม (Anonymized
              Data) ที่ไม่สามารถระบุตัวบุคคลได้ ทั้งนี้
              ตามระเบียบปฏิบัติที่บริษัทฯ กำหนด หรือที่ได้ตกลงกัน
            </p>
            <p class="text-darkgreen-2"><strong>13. การฝึกอบรม </strong></p>
            <p>
              บริษัทฯ
              ให้ความสำคัญกับการจัดฝึกอบรมให้ความรู้และสร้างความตระหนักเกี่ยวกับการปฏิบัติตามกฎหมายคุ้มครองข้อมูลส่วนบุคคลให้กับผู้บริหารและบุคลากรทุกระดับ
              และถือเป็นหน้าที่ของผู้บังคับบัญชาทุกคนที่จะต้องกำหนดให้บุคลากรในสังกัดของตนซึ่งเกี่ยวข้องกับข้อมูลส่วนบุคคล
              ต้องเข้าร่วมฝึกอบรมอย่างเคร่งครัด
              พร้อมกับประเมินและติดตามผลเพื่อให้มั่นใตว่าบุคลากรจะสามารถปฏิบัติงานได้ครบถ้วนและถูกต้องตามกฎหมายคุ้มครองข้อมูลส่วนบุคคล
            </p>
            <p class="text-darkgreen-2">
              <strong>14. นโยบายความเป็นส่วนตัวของเว็บไซด์อื่น </strong>
            </p>
            <p>
              นโยบายความเป็นส่วนตัวฉบับนี้ ใช้เฉพาะการให้บริการของบริษัทฯ
              และการใช้งานเว็บไซด์ของบริษัทฯ เท่านั้น หากลูกค้า คู่สัญญา
              ผู้ใช้บริการ และบุคลากร ได้กดลิงค์ไปยังเว็บไซด์อื่น
              (แม้จะผ่านทางเว็บไซด์ของบริษัทฯ ก็ตาม)
              นโยบายความเป็นส่วนตัวฉบับนี้ รวมถึงข้อกำหนดและเงื่อนไขต่างๆ
              ของบริษัทฯ จะไม่มีผลผูกพัน โดยลูกค้า คู่สัญญา
              ผู้ใช้บริการและบุคลากรจะต้องศึกษาและปฏิบัติตามนโยบายความเป็นส่วนตัวที่ปรากฏบนเว็บไซด์เหล่านั้น
              บริษัทจะไม่รับผิดชอบเกี่ยวกับเนื้อหาหรือการดำเนินการต่างๆ
              ของเว็บไซต์ดังกล่าว
              เนื่องจากบริษัทไม่ได้เป็นผู้ให้บริการเว็บไซต์ดังกล่าว
            </p>
            <p class="text-darkgreen-2">
              <strong>15. ความรับผิดชอบของบุคคล</strong>
            </p>
            <p>
              บริษัทฯ กำหนดให้บุคลากรหรือหน่วยงานที่เกี่ยวข้องกับข้อมูลส่วนบุคคล
              ต้องให้ความสำคัญและรับผิดชอบในการเก็บรวบรวม ใช้
              หรือเปิดเผยข้อมูลส่วนบุคคลตามนโยบายคุ้มครองข้อมูลส่วนบุคคลนี้อย่างเคร่งครัด
              โดยจะต้องปฏิบัติงานให้สอดคล้องกับนโยบาย แนวปฏิบัติ
              คู่มือและกฎหมายอันเกี่ยวกับการปฏิบัติงานนั้น ทั้งนี้
              ความจงใจหรือประมาทเลินเล่อ ละเลยหรือละเว้นไม่สั่งการ
              หรือไม่ดำเนินการ
              หรือสั่งการหรือดำเนินการอย่างใดอย่างหนึ่งในหน้าที่ของตนอันเป็นการฝ่าฝืนนโยบายและแนวปฏิบัติเกี่ยวกับการคุ้มครองข้อมูลส่วนบุคคล
              และ/หรือความเสียหายขึ้น
              บุคลากรอาจต้องรับโทษทางวินัยตามระเบียบของบริษัทฯ
              และต้องรับโทษทางกฎหมายตามฐานความผิดนั้นๆ
              ทั้งนี้หากความผิดดังกล่าวก่อให้เกิดความเสียหายแก่บริษัทและ/หรือบุคคลอื่นใด
              บริษัทฯ อาจพิจารณาดำเนินคดีตามกฎหมายเพิ่มเติมต่อไป
            </p>
            <p class="text-darkgreen-2"><strong>16. ติดต่อเรา </strong></p>
            <p>
              กรณีพบเหตุอันควรสงสัยหรือเชื่อว่ามีการละเมิดการข้อมูลส่วนบุคคล
              การร้องเรียน
              หรือการใช้สิทธิของเจ้าของข้อมูลส่วนบุคคลตามนโยบายฉบับนี้
              หรือตามพระราชบัญญัติคุ้มครองข้อมูลส่วนบุคคล พ.ศ.2562
              หรือสอบถามข้อสงสัย สามารถติดต่อกับเราได้ที่
            </p>
            <p style="padding-left: 50px">
              หัวหน้าคณะทำงาน PDPA <br />
              หมายเลขโทรศัพท์ : (+66)2-683-0008<br />
              หมายเลขแฟกซ์: (+66)2-294-2013<br />
              อีเมล : <a href="mailto:DPO@ubisasia.com">DPO@ubisasia.com</a>
            </p>
          </div>
        </div>
      </div>
      <div class="p-2 lg:p-4 pb-0">
        <div class="form-control">
          <label class="label">
            <span class="label-text">ลมนามยินยอมข้อตกลงในเอกสาร</span>
          </label>
          <div class="relative w-full">
            <label
              v-if="draw"
              class="btn btn-sm btn-circle absolute right-2 top-2"
              @click="clear"
              >✕
            </label>
            <VueSignaturePad
              id="signature"
              width="100%"
              height="200px"
              ref="signaturePad"
              :scaleToDevicePixelRatio="true"
            />
          </div>
        </div>
        <div class="flex">
          <div class="flex-1 form-control py-3 pb-0">
            <button
              class="btn btn-primary text-white"
              @click="saveNregister"
              :disabled="!draw || saving"
            >
              ยินยอม
            </button>
          </div>
        </div>
      </div>
    </div>
  </div>
  <div class="container m-auto h-screen grid content-center">
    <div class="h-full">
      <div class="card shadow-lg bg-base-100">
        <div class="form-control flex-row p-4 relative">
          <label class="label absolute left-0 top-0">
            <span class="label-text"> <LayoutLogo /></span>
          </label>
          <span class="text-primary font-extrabold text-center w-full text-2xl"
            >แบบฟอร์มลงทะเบียนพนักงาน</span
          >
        </div>
        <div class="divider p-0 m-0"></div>
        <div class="card-body overflow-auto p-2 lg:p-4 h-[calc(100vh-10rem)]">
          <div class="grid gap-4 md:grid-cols-1 grid-cols-1">
            <AppModuleGlobalUpload
              :fileLink="`${base.form.imageLink}employee/${base.form.code}/`"
              :file="base.form.image"
              :id="'base'"
              :multiple="false"
              @respone="
                (res) => {
                  base.form.image = base.form.image.concat(res.file);
                }
              "
              @uploaded="
                (res) => {
                  let index = this.base.form.image.findIndex(
                    (v) => v.r == res.r
                  );
                  this.base.form.image[index].upload = false;
                  this.base.form.image[index].file = res.row.file;
                }
              "
              @stream="
                (res) => {
                  let index = base.form.image.findIndex((v) => v.r == res.r);
                  base.form.image[index].loading = res.loading;
                }
              "
              @error="
                (res) => {
                  let index = base.form.image.findIndex((v) => v.r == res.r);
                  base.form.image[index].error = true;
                }
              "
              @again="
                (res) => {
                  let index = base.form.image.findIndex(
                    (v) => v.r == res.file.r
                  );
                  base.form.image[index] = res.file;
                }
              "
              @resetdata="
                (res) => {
                  base.form.image = [...res.file];
                }
              "
            />
            <div class="form-control">
              <label class="label">
                <span class="label-text">Company</span>
              </label>
              <AppModuleGlobalSelectSearch
                :placeholder="'Company'"
                :label="'title'"
                :code="'code'"
                :customClass="`input input-bordered border-base-content`"
                :current="base.form.company"
                @updateValue="
                  (obj) => {
                    base.form.company_data = obj;
                    base.form.company = obj.code;
                  }
                "
                :url="`${this.serviceUrl}api/controllers/MYSQL/INTERNAL/System/company`"
                :param="`&total=1`"
              />
            </div>
          </div>
          <div class="grid gap-4 md:grid-cols-2 grid-cols-1">
            <div class="form-control">
              <label class="label">
                <span class="label-text">Branch</span>
              </label>
              <AppModuleGlobalSelectSearch
                :placeholder="'Branch'"
                :label="'title'"
                :code="'code'"
                :minChar="3"
                :delay="0.5"
                :limit="10"
                :customClass="`input input-bordered border-base-content`"
                :current="base.form.branch"
                @updateValue="
                  (obj) => {
                    base.form.branch_data = obj;
                    base.form.branch = obj.code;
                  }
                "
                :url="`${this.serviceUrl}api/controllers/MYSQL/INTERNAL/System/branch`"
                :param="`&total=1`"
                :image="false"
              />
            </div>
            <div class="form-control">
              <label class="label">
                <span class="label-text">Emp Code</span>
              </label>
              <input
                type="text"
                placeholder="Emp Code"
                class="input input-bordered "
                v-model="base.form.uid"
              />
            </div>
          </div>
          <div class="grid gap-4 md:grid-cols-2 grid-cols-1">
            <div class="form-control">
              <label class="label">
                <span class="label-text">Firstname</span>
              </label>
              <input
                type="text"
                placeholder="Firstname"
                class="input input-bordered "
                v-model="base.form.firstname"
              />
            </div>
            <div class="form-control">
              <label class="label">
                <span class="label-text">Lastname</span>
              </label>
              <input
                type="text"
                placeholder="Lastname"
                class="input input-bordered "
                v-model="base.form.lastname"
              />
            </div>
          </div>
          <div class="grid gap-4 md:grid-cols-2 grid-cols-1">
          <div class="form-control">
            <label class="label">
              <span class="label-text">Department</span>
            </label>
            <AppModuleGlobalSelectSearch
              :placeholder="'Department'"
              :label="'title'"
              :code="'code'"
              :minChar="3"
              :delay="0.5"
              :limit="10"
              :customClass="`input input-bordered border-base-content`"
              :current="base.form.department"
              @updateValue="
                (obj) => {
                  base.form.department_data = obj;
                  base.form.department = obj.code;
                }
              "
              :url="`${this.serviceUrl}api/controllers/MYSQL/INTERNAL/System/department`"
              :param="`&total=1&wh=wh1&rac_list=1`"
              :image="false"
            />
          </div>   <div class="grid gap-4 md:grid-cols-2 grid-cols-1"><div class="form-control">
            <label class="label">
              <span class="label-text">Position</span>
            </label>
            <input
              type="text"
              placeholder="Position"
              class="input input-bordered "
              v-model="base.form.position"
            />
          </div>
            <div class="form-control">
              <label class="label">
                <span class="label-text">Access</span>
              </label>
              <AppModuleGlobalSelectSearch
                :placeholder="'Access'"
                :label="'title'"
                :code="'code'"
                :minChar="3"
                :delay="0.5"
                :limit="10"
                :customClass="`input input-bordered border-base-content`"
                :current="base.form.access_code"
                @updateValue="
                  (obj) => {
                    base.form.access_data = obj;
                    base.form.access_code = obj ? obj.code : '';
                  }
                "
                :url="`${this.serviceUrl}api/controllers/MYSQL/INTERNAL/System/access`"
                :param="`&total=1`"
                :image="false"
              />
            </div>
          </div>
              </div>
       
          <div class="grid gap-4 md:grid-cols-2 grid-cols-1">
            <div class="form-control">
              <label class="label">
                <span class="label-text">Tel</span>
              </label>
              <input
                type="text"
                placeholder="Tel"
                class="input input-bordered "
                v-model="base.form.tel"
              />
            </div>
            <div class="grid gap-4 md:grid-cols-2 grid-cols-1">
            <div class="form-control">
              <label class="label">
                <span class="label-text">Birthday</span>
              </label>
              <input
                type="date"
                placeholder="Birthday"
                class="input input-bordered "
                v-model="base.form.birthdate"
              />
            </div>
            <div class="form-control">
              <label class="label">
                <span class="label-text">Work Start Date</span>
              </label>
              <input
                type="date"
                placeholder="Work Start Date"
                class="input input-bordered "
                v-model="base.form.started_at"
              />
            </div>
            <!-- <div class="form-control">
              <label class="label">
                <span class="label-text">End Of Work Date</span>
              </label>
              <input
                type="date"
                placeholder="End Of Work Date"
                class="input input-bordered "
                v-model="base.form.leaves_at"
              />
            </div> -->
          </div>
          </div>
          
          <div class="form-control pt-4">
            <div class="w-full overflow-auto">
              <label class="label cursor-pointer">
                <span class="label-text">Email</span>
              </label>
              <table
                class="table table-xs table-pin-rows table-pin-cols table-zebra"
              >
                <thead>
                  <tr>
                    <th v-if="removing">
                      <input
                        type="checkbox"
                        class="checkbox checkbox-sm"
                        id="my-checkbox"
                        ref="removeingList"
                        @click="
                          () => {
                            $refs.removeingList.indeterminate = false;
                            if ($refs.removeingList.checked) {
                              detail.rows = detail.rows.map((v) => {
                                v.remove = true;
                                return v;
                              });
                            } else {
                              detail.rows = detail.rows.map((v) => {
                                v.remove = false;
                                return v;
                              });
                            }
                          }
                        "
                      />
                    </th>
                    <th>#</th>
                    <td>Code</td>
                    <td>Email</td>
                    <th class="text-right">
                      <div v-if="!removing">
                        <button
                          class="btn btn-xs btn-primary text-white mr-1"
                          :class="base.controll != 'create' ? 'mr-1' : ''"
                          @click="detail_add_row()"
                        >
                          <Icon icon="el:file-new" />
                        </button>
                        <button
                          v-if="base.controll != 'create'"
                          class="btn btn-xs btn-error text-white"
                          @click="removing = true"
                        >
                          <Icon icon="icomoon-free:bin" />
                        </button>
                      </div>
                      <div v-else>
                        <label
                          for="modal-remove"
                          class="btn btn-xs btn-error text-white mr-1"
                          @click="
                            removeAllSelect(
                              'detail',
                              'controllers/MYSQL/INTERNAL/HR/email'
                            )
                          "
                        >
                          <Icon icon="ic:outline-check" />
                        </label>
                        <button
                          class="btn btn-xs btn-warning btn-primary text-white mr-1"
                          @click="
                            () => {
                              removing = false;
                              this.detail.rows.map(
                                (v) => (v['remove'] = false)
                              );
                            }
                          "
                        >
                          <Icon icon="ic:twotone-close" />
                        </button>
                      </div>
                    </th>
                  </tr>
                </thead>
                <tbody>
                  <tr
                    class="hover"
                    v-for="(v, i) in detail.rows"
                    :key="i"
                    :class="`${v.removed || v.remove ? 'disabled' : ''}`"
                  >
                    <th v-if="removing">
                      <div class="flex items-center space-x-3">
                        <input
                          type="checkbox"
                          class="checkbox checkbox-sm"
                          :checked="v.remove"
                          @click="
                            () => {
                              v.remove = !v.remove;
                              let remove = detail.rows.filter((v) => v.remove);
                              if (remove.length == 0) {
                                $refs.removeingList.checked = false;
                                $refs.removeingList.indeterminate = false;
                              } else if (remove.length == detail.rows.length) {
                                $refs.removeingList.checked = true;
                                $refs.removeingList.indeterminate = false;
                              } else {
                                $refs.removeingList.checked = false;
                                $refs.removeingList.indeterminate = true;
                              }
                            }
                          "
                        />
                      </div>
                    </th>
                    <th>
                      <div class="flex items-center space-x-3">
                        <input
                          :disabled="!v.id || removing"
                          type="checkbox"
                          :checked="v.code == base.form.email"
                          class="checkbox checkbox-sm"
                          @click="
                            () => {
                              base.form.email =
                                base.form.email == v.code ? '' : v.code;
                            }
                          "
                        />
                      </div>
                    </th>
                    <td>
                      <div class="text-sm" v-if="!v.new">
                        <span
                          v-if="v.edit"
                          class="badge badge-sm badge-warning text-white"
                        >
                          Edit
                        </span>
                        <span>{{ v.code ? v.code : "-" }}</span>
                      </div>
                      <span
                        v-else
                        class="badge badge-sm badge-primary text-white"
                      >
                        N<span class="hidden md:block">ew</span>
                      </span>
                    </td>
                    <td>
                      <input
                        class="input input-xs input-bordered border-base-content join-item w-full"
                        placeholder="Email"
                        v-model="v.email"
                        @keyup="
                          () => {
                            v.new ? '' : (v.edit = true);
                          }
                        "
                        :disabled="removing"
                      />
                    </td>
                    <th class="text-right">
                      <label
                        v-if="!removing && v.id"
                        for="modal-remove"
                        class="btn btn-link no-underline text-error modal-button btn-xs"
                        @click="
                          remove_item(
                            `${v.code}`,
                            'detail',
                            'controllers/MYSQL/INTERNAL/HR/email'
                          )
                        "
                      >
                        Remove
                      </label>
                      <button
                        v-if="!removing && !v.id"
                        class="btn btn-link no-underline text-error modal-button btn-xs"
                        @click="detail.rows.splice(index, 1)"
                      >
                        Drop
                      </button>
                    </th>
                  </tr>
                </tbody>
              </table>
            </div>
          </div>
          <div class="backdrop-blur sticky top-0 items-center gap-2 flex">
            <div class="flex-1 form-control mt-6">
              <label
                for="modal-base"
                class="btn btn-primary text-white"
                @click="base_create()"
                >Create</label
              >
            </div>
          </div>
        </div>
      </div>
    </div>
  </div></div>
</template>
<style>
.crop {
  white-space: nowrap;
  text-overflow: ellipsis;
  overflow: hidden;
  max-width: 1px;
}
</style>
<script>
// @ is an alias to /src
import AppModuleGlobalUpload from "@/components/App/Module/Global/Upload.vue";
import AppModuleGlobalSelectSearch from "@/components/App/Module/Global/SelectSearch.vue";
import LayoutLogo from "@/components/Layout/Logo.vue";

import Query from "@/assets/js/fetch.js";

export default {
  name: "Employee",
  components: {
    AppModuleGlobalUpload,
    AppModuleGlobalSelectSearch,
    LayoutLogo,
  },
  data() {
    return {
      test: false,
      test2: false,
      saving: false,
      interval: null,
      draw: false,
      temp: [],
      removing: false,
      base: {
        controll: "create",
        rows: [],
        total: 0,
        page: 1,
        row: 20,
        q: "",
        next: false,
        back: false,
        loading: false,
        modal: false,
        form: {
          code: "",
          imageLink: "",
          image: [],
        },
      },
      detail: {
        rows: [],
        total: 0,
        page: 1,
        row: 20,
        q: "",
        next: false,
        back: false,
        loading: false,
        modal: false,
        form: {
          code: "",
          imageLink: "",
          image: [],
        },
      },
      remove: {
        current: 0,
        model: false,
        controll: "",
        tb: "",
      },
      imageSrc: null,
    };
  },
  computed: {
    serviceUrl() {
      return this.$store.getters.serviceUrl;
    },
    user_token() {
      return this.$store.getters.user_token;
    },
  },
  methods: {
    // signaturePadisEmpty() {
    //   return true
    //   // return this.$refs.signaturePad.isEmpty();
    // },
    // undo() {
    // console.log(this.$refs.signaturePad.isEmpty());
    // this.$refs.signaturePad.undoSignature();
    // },
    clear() {
      this.$refs.signaturePad.clearSignature();
    },
    async saveNregister() {
      if(!this.base.form.uid)return alert("กรุณากรอก UID ( หรือรหัสพนักงาน )");
      this.saving = true;
      this.$refs.signaturePad.lockSignaturePad();
      await this.save();
      await this.base_save();

      // await console.log("DSAASDASDASDasdasd");
      // @click="base_save()"
    },
    async save() {
      return new Promise((resolve) => {
        const { isEmpty, data } = this.$refs.signaturePad.saveSignature();
        fetch(
          `${this.serviceUrl}api/controllers/MYSQL/INTERNAL/Global/signature?uid=${this.base.form.uid}`,
          {
            method: "POST",
            headers: {
              "Content-Type": "application/json",
              Authorization: `Bearer ${this.user_token}`,
            },
            body: JSON.stringify({
              signature: data,
            }),
          }
        )
          .then((response) => response.json())
          .then((res) => {
            console.log(res);
            if (!res.success) {
              // localStorage.removeItem("user_token");
              // this.$router.push({ name: `Login` });
            } else {
              //  alert("success")
              this.$emit("changetab", "profile");
            }
            resolve();
          })
          .catch((error) => {
            console.error("Error:", error);
          });
      });
    },
    // acceptNumber() {
    //   var x = this.temp.tel
    //     .replace(/\D/g, "")
    //     .match(/(\d{0,3})(\d{0,3})(\d{0,4})/);
    //   this.temp.tel = !x[2] ? x[1] : x[1] + x[2] + x[3];
    // },
    // update() {
    //   console.log("UPDATe");
    //   this.$emit("update_profile", this.temp);
    // },

    // base
    base_search() {
      this.base.loading = true;
      this.base_get((res) => {
        this.base.rows = res.rows;
        this.base.total = res.total;
        this.base.next =
          this.base.page * this.base.row >= this.base.total ? false : true;
        this.base.back = this.base.page > 1 ? true : false;
        this.base.loading = false;
      });
    },
    base_get(callback) {
      new Query("base", "get").get(
        this,
        `${
          this.serviceUrl
        }api/controllers/MYSQL/INTERNAL/HR/employee?total=1&page=${
          this.base.page
        }${this.base.row ? `&rows=${this.base.row}` : ""}${
          this.base.q ? `&q=${this.base.q}` : ""
        }`,
        (res) => {
          if (!res.success) {
            // localStorage.removeItem("user_token");
            // this.$router.push({ name: `Login` });
          } else {
            res.rows.forEach((v, i) => {
              res.rows[i].image = v.image ? JSON.parse(v.image) : [];
              res.rows[i].master = 0;
            });
          }
          callback({ ...res });
        }
      );
    },
    base_create() {
      // console.log("DASDASDAS")
      this.removing = false;
      this.base.current = 0;
      // this.base.form = {
      //   code: "",
      //   imageLink: "",
      //   image: [],
      // };
      this.detail.rows = [];
      this.base.controll = "create";
      this.interval = setInterval(() => {
        this.draw = !this.$refs.signaturePad.isEmpty();
      }, 100);
    },
    base_edit(code, index) {
      this.removing = false;
      this.base.form = { ...this.base.rows[index] };
      this.base.current = code;
      this.detail.rows = [];
      this.base.controll = "edit";
      this.detail_search();
    },
    base_save() {
      let vm = this;
      let image = this.base.form.image[0]
        ? { ...this.base.form.image[0] }
        : null;
      image ? delete image.temp : "";
      if (this.base.controll == "create") {
        this.base.form.new_password = this.base.form.uid;
      }
      let obj = {
        code: this.base.current,
        rows: [
          {
            ...Object.assign(
              { ...this.base.form },
              {
                image: image ? [image] : [],
              }
            ),
          },
        ],
      };

      new Query("base", this.base.controll == "create" ? "POST" : "PUT").set(
        this,
        `${this.serviceUrl}api/controllers/MYSQL/INTERNAL/HR/employee`,
        obj,
        (res) => {
          if (!res.success) {
          } else {
            this.base.current == 0
              ? (this.base.current = res.rows[0].code)
              : "";
            this.detail.controll = "create";
            const detail = new Promise(
              async (resolve, reject) => await resolve(vm.detail_save())
            );

            detail.then((res) => {
              this.base.modal = false;
              // this.base.page = 1;
              // this.detail.page = 1;
              // this.base_search();
              // window.close();
              this.test = true;
            });
          }
        }
      );
    },
    // DETAIL
    detail_search() {
      this.detail.loading = true;
      this.detail_get((res) => {
        this.detail.rows = res.rows;
        this.detail.total = res.total;
        this.detail.next =
          this.detail.page * this.detail.row >= this.detail.total
            ? false
            : true;
        this.detail.back = this.detail.page > 1 ? true : false;
        this.detail.loading = false;
      });
    },
    detail_get(callback) {
      new Query("detail", "get").get(
        this,
        `${
          this.serviceUrl
        }api/controllers/MYSQL/INTERNAL/HR/email?total=1&page=${
          this.detail.page
        }${this.detail.row ? `&rows=${this.detail.row}` : ""}${
          this.detail.q ? `&q=${this.detail.q}` : ""
        }${this.base.current ? `&current=${this.base.current}` : ``}`,
        (res) => {
          if (res.success) {
            res.rows.forEach((v, i) => {
              res.rows[i].image = v.image ? JSON.parse(v.image) : [];
              res.rows[i].master = 0;
            });
          }
          callback({ ...res });
        }
      );
    },
    detail_add_row() {
      this.detail.form = {
        code: this.$moment().format("YYYYMMDD") + this.detail.rows.length,
        new: true,
      };
      this.detail.rows.unshift(this.detail.form);
    },
    detail_create() {
      this.detail.current = 0;
      this.detail.form = {
        code: "",
      };
      this.detail.controll = "create";
    },
    detail_edit(code) {
      this.detail.current = code;
      let index = this.detail.rows.findIndex(
        (v) => v.code == this.detail.current
      );
      this.detail.form = Object.assign({}, this.detail.rows[index]);
      this.detail.controll = "edit";
    },
    detail_save() {
      let rows = this.detail.rows.map((v) =>
        Object.assign({}, v, { emp: this.base.current })
      );
      if (rows.length == 0) {
        return;
      }

      let object = {
        POST: rows.filter((v) => v.new),
        PUT: rows.filter((v) => v.edit),
      };

      console.log(object);
      for (let key in object) {
        if (object[key].length == 0) {
          continue;
        }

        new Query("detail", key).set(
          this,
          `${this.serviceUrl}api/controllers/MYSQL/INTERNAL/HR/email`,
          { rows: object[key] },
          (res) => {
            if (!res.success) {
            } else {
              console.log(res);
            }
          }
        );
      }
    },
    // REMOVE
    removeAllSelect(controll, tb) {
      // this.removing = false;
      let rows = this.detail.rows.filter((v) => v["remove"]);

      // console.log(code);
      this.remove.rows = rows;
      this.remove.controll = controll;
      this.remove.tb = tb;
    },
    remove_item(code, controll, tb) {
      // console.log(code);
      this.remove.rows = null;
      this.remove.code = code;
      this.remove.controll = controll;
      this.remove.tb = tb;
    },
    confirm_remove() {
      fetch(`${this.serviceUrl}api/${this.remove.tb}`, {
        method: "DELETE",
        headers: {
          "Content-Type": "application/json",
          Authorization: `Bearer ${this.user_token}`,
        },
        body: JSON.stringify({
          rows: this.remove.rows
            ? this.remove.rows
            : [{ code: this.remove.code }],
        }),
      })
        .then((response) => response.json())
        .then((res) => {
          if (!res.success) {
          } else {
            let index = this.detail.rows.findIndex(
              (v) => v.code == this.remove.code
            );
            console.log(this.remove.rows ? "a" : "b");
            this.remove.rows
              ? (this.remove.rows = [])
              : index >= 0
              ? (this.detail.rows[index]["removed"] = true)
              : "";
            this.remove.modal = false;
            this.removing = false;
            this.remove.controll == "detail"
              ? ""
              : this[`${this.remove.controll}_search`]();
          }
        })
        .catch((error) => {
          console.error("Error:", error);
        });
    },
  },
  unmounted() {
    this.interval ? clearInterval(this.interval) : "";
  },
  mounted() {
    this.$nextTick(() => {
      this.base_search();
    });
  },
  watch: {
    test(v) {
      if (v) return;
      window.close();
    },
    "base.modal"(v) {
      if (v) return;
      this.interval ? clearInterval(this.interval) : "";
    },
  },
};
</script>

<style>
tr.disabled {
  pointer-events: none;
  opacity: 0.3;
  text-decoration: line-through;
  text-decoration-color: red;
}
#signature {
  border: double 1px transparent;
  border-color: lightgray;
  border-radius: 5px;

  background-image: linear-gradient(white, white),
    radial-gradient(circle at top left, #000000, #000000);
  background-origin: border-box;
  background-clip: content-box, border-box;
}
</style>
